{
  "hadiths": [
    {
      "number": 1,
      "title": "Niat",
      "arabicTitle": "",
      "imagePath": "assets/images/h1.jpg",
      "audioPath": "assets/audio/hadith1.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith1.png"
      ],
      "htmlDescription": "Dari Amirul Mukminin Umar Al-Khattab r.a katanya: \" Aku mendengar Rasulullah S.A.W. bersabda : - <br><br> \"Bahawasanya amalan-amalan itu adalah (bergantung) kepada niat, dan bahawasanya bagi setiap manusia itu apa (balasan) yang diniatkannya. Maka barangsiapa yang berhijrah kepada Allah dan RasulNya, <br><br> maka hijrahnya itu adalah kepada Allah dan RasulNya. Dan barangsiapa yang berhijrah kerana dunia yang ingin ia memperolehinya atau kerana seorang perempuan yang ingin ia dinikahinya, maka hijrahnya itu adalah atas apa yang ia berhijrah kerananya.\"  <br><br> (Riwayat al-Bukhari no.1, 54, 2529, 3898, 5070, 6689, 6953, Muslim no. 1907, Abu Daud no. 2201, al-Tirmizi no. 1646, al-Nasai`i no.1/59-60, VI/158, Ibn Majah no. 4227 dan Ahmad no. 1/25, 43)\n<br><br><br>\nCatatan :\n<br><br>\nHadits ini merupakan salah satu dari hadits-hadits yang menjadi inti ajaran Islam. Imam Ahmad dan Imam syafi’i berkata : Dalam hadits tentang niat ini mencakupi sepertiga ilmu. Sebabnya adalah bahwa perbuatan hamba terdiri dari perbuatan hati, lisan dan anggota badan, sedangkan niat merupakan salah satu dari ketiganya. <br> Diriwayatkan dari Imam Syafi’i bahwa dia berkata : Hadits ini mencakupi tujuh puluh bab dalam fiqh. Sejumlah ulama bahkan ada yang berkata : Hadits ini merupakan sepertiga Islam.\n<br><br>\nHadis ini ada sebabnya, iaitu: ada seseorang yang berhijrah dari Mekkah ke Madinah dengan tujuan untuk dapat menikahi seorang wanita yang bernama : “Ummu Qais” bukan untuk mendapatkan keutamaan hijrah. Maka orang itu kemudian dikenal dengan sebutan “Muhajir Ummi Qais” (Orang yang berhijrah kerana Ummu Qais).\n<br><br>\nHadis ini adalah salah satu hadis utama dalam lslam.\n<br><br>\nPokok perbincangan hadis :\n<br><br>\n1) Sebab keluar Hadis ini : kisah Hijrah Ummu Qais\n<br><br>\n2) Kenapa niat penting :\n<br>  - untuk bezakan ibadat dengan adat.\n<br>    - untuk tentukan qasad amal <br> - adakah untuk Allah atau lainnya.\n<br><br>\n3) Hukum melafazkan niat(jahr) - bid'ah mungkarah : tidak thabit dalam quran dan sunnah - (asal ibadah haram kecuali berdalil) - fuqaha'  Syafie : sunnat haram sekiranya dengan jahr niat boleh mengganggu orang lain (solat).\n<br><br>\n4) Kesan niat baik pada perkara yang harus : dikira sebagai qurbah (hampir dengan Allah), dan diberi pahala baginya makan minum - niat nak buat ketaatan/ memberi nafkah - (hak anak/isteri), jima'@ bergaul dgn isteri - dikira ibadah (memberi hak).\n<br><br>\n5) Beberapa Langkah Perkara Harus bertukar menjadi Qurbah : Tidak boleh jadikan gambaran luaran perkara harus sebagai qurbah. Contohnya:  berdiri di bawah panas matahari..(hadis nazar seorang lelaki). Perkara yang mubah sebagai wasilah kepada ibadah. Mengambil ia sebagai tasyri' ilahi - yakin bahawa ianya harus/ tidak melampau/ menepati syariat. Menganggap ianya sebagai juz'ie - tak boleh berpanjangan sehingga membinasakan diri.\n<br><br>\nAntara pengajaran hadis:\n<br><br>\nNiat adalah teras segala amalan. <br>Amalan baik mesti disertakan niat yang baik.  Amalan yang buruk atau amalan yang baik tetapi dijalankan tidak mengikut aturan syara', tidak membawa apa-apa faedah walaupun dilakukan dengan niat yang baik. Demikian juga amalan baik jika diniatkan bukan kerana Allah, seumpama kerana riya', menunjuk-nunjuk atau kerana suatu tujuan duniawi, maka ia tidak memberikan apa-apa faedah.\n<br><br>\nUlama ada berkata: Boleh jadi suatu amalan kecil menjadi besar kerana niat dan suatu amalan yang besar menjadi kecil kerana niat. Sesuatu amalan dibalas berdasarkan niat pelakunya.\n<br><br>\nHijrah adalah suatu peristiwa besar dalam lslam di mana umat lslam diperintahkan berhijrah. Sesiapa yang berhijrah kerana Allah dan RasulNya, dia akan dikurniakan pahala besar, sebaliknya jika kerana dunia atau perempuan, maka dia hanya mendapat apa yang diniatkannya.\n<br><br>\nWalaupun hijrah sudah tiada lagi, namun hijrah dengan makna meninggalkan maksiat kepada melakukan taat, ia juga dianggap hijrah yang akan dikurniakan pahala."
    },
    {
      "number": 2,
      "title": "Iman, Islam dan Ihsan",
      "arabicTitle": "",
      "imagePath": "assets/images/h2.jpg",
      "audioPath": "assets/audio/hadith2.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith2.png",
        "assets/images/hadith2_2.png"
      ],
      "htmlDescription": "Daripada Saiyidina 'Umar juga, r.a. beliau berkata:  Ketika kami sedang duduk di sisi Rasulullah SAW pada suatu hari, <br> tiba-tiba muncul di hadapan kami seorang lelaki yang memakai pakaian yang sangat putih, berambut sangat hitam, yang tidak ternampak pada dirinya kesan-kesan tanda musafir dan tidak seorangpun di kalangan kami yang mengenalinya. <br><br> Lalu dia duduk menghampiri Nabi SAW lalu disandarkan kedua-dua lututnya ke lutut Baginda dan meletakkan dua tapak tangannya atas dua paha Baginda seraya berkata: <br> Wahai Muhammad! Terangkan kepadaku tentang lslam. <br>Lalu Rasulullah SAW bersabda: lslam itu bahawa engkau naik saksi bahawa tiada Tuhan melainkan Allah dan bahawa Muhammad itu utusan Allah, <br>(dan bahawa) engkau mendirikan sembahyang, mengeluarkan zakat, berpuasa di bulan Ramadhan, menunaikan haji ke BaitulLah (Mekah) sekiranya engkau berkuasa mengerjakannya. <br><br>Lelaki tersebut berkata: Benarlah engkau. <br>Maka kamipun merasa hairan kepadanya, dia yang bertanya dia pula yang membenarkannya. <br><br> Dia bertanya: Terangkan kepadaku tentang lman. Baginda bersabda: (lman itu ialah) bahawa engkau percaya kepada Allah, para MalaikatNya, kitab-kitabNya, para RasulNya, hari Qiamat dan bahawa engkau percaya kepada Qadar baik dan buruk. Lelaki itu berkata: Benarlah engkau. <br><br>Dia berkata lagi:Terangkanlah kepadaku tentang Ehsan. Baginda bersabda: Ehsan itu ialah bahawa engkau menyembah Allah seolah-olah engkau melihatNya. Sekiranya engkau tidak dapat melihatnya, maka sesungguhnya Dia melihatmu. <br><br>Lelaki itu bertanya lagi: Terangkan kepadaku tentang Qiamat. Baginda bersabda: Orang yang ditanya tentang Qiamat tidaklah lebih mengetahui daripada orang yang bertanya. Lelaki itu berkata: Maka terangkanlah kepadaku tentang tanda-tandanya. <br>Baginda bersabda: (Antara tandatandanya ialah) apabila seorang hamba perempuan melahirkan tuannya dan apabila engkau melihat orang-orang miskin yang berkaki ayam, tidak berpakaian dan papa kedana yang hanya menjadi pengembala kambing berlumba-lumba membina bangunan (iaitu bertukar menjadi kaya raya).  <br><br>Kemudian lelaki itu berlalu, lalu aku terdiam sebentar. Kemudian Baginda bertanya: Wahai 'Umar! Adakah engkau tahu siapa lelaki yang bertanya itu? <br>Aku berkata: Allah dan RasulNya lebih mengetahui. <br>Baginda bersabda: Sesungguhnya dia adalah Malaikat Jibril yang datang kepada kamu untuk mengajar kamu tentang agama kamu.     <br><br>        Hadis riwayat al-lmam Muslim (Hadis riwayat Muslim, kitab al-iman, no: 9 dan 10, al-Tirmizi, kitab al-iman, no:2535, beliau berkata: hadis ini hasan shahih, al-Nasaa'ie, kitab al-iman, no: 4904, 4905, Abu Dawud, kitab al-sunnah,no:4075, Ibn Majah, kitab al-muqaddimah, no: 62 dan 63, Ahmad, musnad , no: 346).\n\n<br><br><br>\nPokok Perbincangan Hadis :\n<br><br>\n    Kedudukan hadis ini :  ibu kepada hadis-hadis lain,mengandungi penjelasan Din secara keseluruhannya.\n<br><br>\n    Islam : terangkum ibadat badani/ lisani/ maali/ badani wa maali.\n<br><br>\n    Iman : asal iman/ iman dan islam/ qaul - amal juga sebahagian dari iman.\n<br><br>\n    Membezakan antara sifat Allah dengan sifat makluk.\n    Tanda-tanda kedatangan hari Qiamat.\n<br><br>\n    Sifat-sifat Jilbril (Ruh Al-Amiin).\n<br><br>\nPengajaran hadis:\n<br><br>\nAgama lslam adalah agama yang datang dari Allah. Oleh itu ia dipanggil agama samawie atau bersifat Rabbaanie, iaitu bersumberkan wahyu dari langit yang diturunkan melalui malaikat Jibril. la bukanlah agama ciptaan akal manusia yang cetek, kerana itu ia amat sesuai untuk seluruh umat manusia di setiap tempat dan zaman.\n<br><br>\nHadis ini menerangkan tiga tunggak agama, iaitu rukun lslam, rukun iman dan ehsan. Rukun lslam lima perkara iaitu mengucap dua kalimah syahadah, mendirikan sembahyang lima waktu, membayar zakat, berpuasa di bulan Ramadhan dan mengerjakan haji di Baitullahilharam. Rukun lman enam perkara iaitu percaya atau beriman kepada Allah, para malaikat, kitab-kitab, para Rasul, hari Qiamat dan beriman dengan qadar baik dan buruk datang dari Allah.\n<br><br>\nKesempurnaan seorang mukmin akan tercapai apabila dia menunaikan segala rukun lslam, menyempurnakan tuntutan rukun iman dan sifat ehsan. lslam tidak sempurna kalau hanya diambil dari segi zahir sahaja, atau batin sahaja atau aspek kerohanian semata-mata. Kesempurnaan lslam hanya akan terserlah apabila diamalkan keseluruhannya.\n<br><br>\nllmu dalam lslam mestilah dipelajari secara berguru dan berdasarkan panduan yang betul. llmu agama tidak boleh dipelajari melalui mimpi dan sebagainya. Seorang murid mestilah mempunyai adab-adab yang tinggi sebagaimana beradabnya Jibril ketika datang mengadap Rasulullah SAW untuk bertanya beberapa soalan agama. Demikian juga seorang guru mestilah mempunyai adab yang tinggi. Dia sewajibnya hanya mengajar atau menjawab soalan yang diketahui dan meninggalkan apa yang dia tidak tahu. ltu adalah tanda wara' para ulama dan orang berilmu.\n<br><br>\nHari qiamat adalah peristiwa besar yang menjadi salah satu rukun lman. Tiada seorang manusiapun yang tahu bila ia akan berlaku, walaupun Rasulullah SAW. la adalah sebahagian dari ilmu ghaib yang tidak diketahui kecuali oleh Allah SWT. Sesiapa yang mengaku tahu bila berlaku qiamat atau mengetahui ilmu ghaib, maka dia adalah seorang penipu besar.\n<br><br>\nWalaupun tarikh qiamat tidak diketahui, namun ada beberapa tanda yang menunjukkan ia hampir tiba, antaranya ialah terjadi peristiwa seorang ibu melahirkan tuannya atau bossnya sendiri, yang menjadi hamba kepada anaknya. Di akhir zaman juga berlaku peristiwa si-miskin yang papa merempat bertukar menjadi hartawan yang kaya raya."
    },
    {
      "number": 3,
      "title": "Rukun Islam",
      "arabicTitle": "",
      "imagePath": "assets/images/h3.jpg",
      "audioPath": "assets/audio/hadith3.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith3.png"
      ],
      "htmlDescription": "Daripada Abu Abdul Rahman Abdullah ibn 'Umar ibn al-Khatthab r.a. beliau berkata: Aku telah mendengar Rasulullah SAW bersabda: \"lslam itu terbina atas lima perkara: Naik saksi mengaku bahawa sesungguhnya tiada Tuhan melainkan Allah dan bahawa sesungguhnya Muhammad itu adalah Utusan Allah, Mendirikan sembahyang, mengeluarkan zakat, mengerjakan haji ke Baitullah dan menunaikan puasa pada bulan Ramadhan.\" <br><br>  (Riwayat al-Bukhari Kitab al-Iman no.8 dan Muslim Kitab al-Imam no. 16)<br><br><br>\nPokok Perbincangan Hadis :\n<br><br>\nBinaan Islam : Diibaratkan sebagai penyelamat manusia yang mengeluarkannya dari daerah kekufuran dan melayakkannya masuk syurga serta jauh dari neraka. Struktur binaan yang kemas dan kukuh dengan asas-asas dan cabang-cabangnya.\n<br><br>\nIkatan Antara Rukun-Rukun Islam :\n<br><br>- Sempurna iman bagi yang menerima sepenuhnya\n<br> - Bagi yang menolak semuanya - hukumnya kafir\n<br> - Sesiapa yang ingkar salah satu - bukan muslim (ijma)\n<br> - Sesiapa yang menerima tapi malas melakukannya (kecuali syahadah) - fasiq<br>\n<br> - Sesiapa yang melakukan dan iqrar secara pura-pura - munafiq\n<br><br>\nMatlamat Ibadat :<br><br>\n- Syahadah : syarat diterima amalan lain.<br>\n- Solat : penghubung antara hamba dengan tuhannya - pertama dihisab.<br>\n- Zakat : suburkan harta/ berkat - sucikan diri.\n<br>- Haji : tidak harus bagi orang yang berkemampuan untuk itu melewatkan pemergiannya - wajib segerakan.\n\n<br><br>- Haji Mabrur merupakan sebaik-baik jihad.\n<br><br>\n- Puasa : syahwat dikengkang/ maksiat terhindar - sebab kepada ketinggian darjah di sisi Allah.\n<br><br>\nPengajaran hadis:\n<br><br>\nHadis ini juga menerangkan tentang rukun lslam lima perkara. Hadis ini mengumpamakan lslam sebagai sebuah binaan yang berdiri tegak dengan lima batang tiang. Tanpa lima perkara ini lslam seseorang akan goyah dan runtuh. lni membayangkan betapa rukun-rukun ini mestilah ditegakkan oleh setiap muslim dengan penuh ikhlas dan tanggungjawab. Menegakkan rukun lslam bermakna kesempurnaan, keteguhan, keutuhan dan keelokan binaan lslam sebaliknya kecuaian bererti keruntuhan, kehancuran dan kemusnahan lslam."
    },
    {
      "number": 4,
      "title": "Manusia Awal dan Akhirnya",
      "arabicTitle": "",
      "imagePath": "assets/images/h4.jpg",
      "audioPath": "assets/audio/hadith4.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith4.png"
      ],
      "htmlDescription": "Daripada Abu Abdul Rahman Abdullah ibn Mas'uud r.a. beliau berkata: Rasulullah SAW telah bersabda, dan Baginda adalah seorang yang benar lagi dibenarkan (iaitu dipercayai): <br><br>Sesungguhnya setiap orang di kalangan kamu dihimpunkan kejadiannya dalam perut ibunya selama 40 hari berupa air mani, kemudian menjadi segumpal darah selama tempoh yang sama, kemudian menjadi seketul daging selama tempoh yang sama, kemudian dikirimkan kepadanya seorang malaikat lalu dia menghembuskan padanya ruh dan dia diperintahkan dengan 4 kalimat; iaitu supaya menulis rezekinya, ajalnya, amalannya dan adakah dia celaka atau bahagia. <br><br>Demi Allah Yang tiada Tuhan melainkanNya, sesungguhnya salah seorang dari kalangan kamu akan beramal dengan amalan ahli syurga, sehingga jarak antaranya dan syurga tidak lebih dari sehasta, lalu dia didahului oleh ketentuan tulisan kitab lantas dia mengerjakan amalan ahli neraka lalu dia memasuki neraka.<br><br> Dan sesungguhnya salah seorang dari kalangan kamu akan beramal dengan amalan ahli neraka, sehingga jarak antaranya dengan neraka tidak lebih dari sehasta, lalu dia didahului oleh ketentuan tulisan kitab lantas dia mengerjakan amalan ahli syurga lalu dia memasuki syurga. <br><br>(Riwayat al-Bukhari no. 3208 dan Muslim no. 2643(1))\n<br><br><br>\nKefahaman Hadis :\n<br><br>\n- Peringkat Pertumbuhan Janin Dalam Rahim :\nAyat-ayat yang berkaitan dengannya (Al-Haj : 5) (Al- Mu'minun :12-14)\nHikmat di sebalik kejadian berperingkat-peringkat : Sebagai pengajaran kepada manusia untuk mencapai tahap kesempurnaan ma'nawi mestilah melalui cara ((tadarruj)) beransur-ansur tidak gopoh atau gelojoh.\n<br><br>\n- Ditiup Ruh :\nSepakat ulama' menyatakan bahawa ruh ditiup pada janin selepas 120 hari disenyawakan.\nHikmat bagi perempuan yang kematian suami, baginya iddah selama empat bulan sepuluh hari, bagi menjamin kesucian rahimnya(tak mengandung).\n<br><br>\n- Menggugurkan Janin :\nSepakat ulama' menyatakan haram (setelah ditiupkan ruh) - dikira sebagai jenayah dan wajib membayar diat (denda) bila digugurkan, sekalipun mati selepas itu. Gugurkan sebelum ditiupkan ruh - juga haram pada kebanyakan pendapat. Ada yang kata boleh tapi pendapat yang dhaif.\n<br><br>\n- Keluasan Ilmu Allah\nMaha mengetahui keadaan-keadaan makhluk sebelum dijadikan samada iman dan taat atau kufur dan maksiat, bahagia atau derita semua dalam pengetahuannya. Ilmu Allah tidak menghalang manusia dari berikhtiar (Al- Syams: 7-10).\n<br><br>\nPengajaran hadis:\n<br><br>\nKejadian manusia yang unik menunjukkan kekuasaan Allah SWT mencipta makhlukNya, seterusnya menjadi dalil bahawa hanya Dialah Tuhan yang berhak disembah. Kejadian manusia mesti menjadi renungan manusia yang berakal, kerana kejadiannya yang teramat indah dan unik ini tiada tolok bandingnya - manusia tidak mampu mencipta manusia atau robot bernyawa dan berakal fikiran.\n<br><br>\nProses kejadian manusia yang berperingkat-peringkat ini telah diceritakan oleh lslam melalui al-Qur'an dan hadis Nabi semenjak 14 kurun lampau, tetapi manusia baru benar-benar arif tentang proses ini di zaman kemajuan sains. lni adalah bukti yang jelas bahawa Allah SWT yang mencipta makhluk ini, Dia jugalah yang Maha mengetahui rahsia kejadian mereka.\n<br><br>\nEmpat ketentuan hidup manusia telah ditetapkan oleh Allah SWT semenjak dia belum lahir ke bumi - rezekinya, ajal kematiannya, amalannya dan nasibnya sama ada dia akan menjadi seorang yang susah atau senang.\n<br><br>\nAmalan terakhir manusia adalah faktor penentu kepada nasibnya yang kekal abadi di akhirat. Boleh jadi dia sangat baik si sepanjang hayat - tetapi di saat terakhir dia melakukan perbuatan ahli neraka, iaitu maksiat lalu dia mati dan mendapat balasan neraka. Begitulah sebaliknya."
    },
    {
      "number": 5,
      "title": "Bida'ah",
      "arabicTitle": "",
      "imagePath": "assets/images/h5.jpg",
      "audioPath": "assets/audio/hadith5.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith5.png"
      ],
      "htmlDescription": "Daripada Ummu al-Mukminin Ummu Abdullah 'Aisyah r.a. beliau berkata: Rasulullah SAW telah bersabda: <br> <br>  Barangsiapa yang mengada-adakan sesuatu perkara yang baru(bidaah) dalam urusan(agama) kami ini, amalan yang bukan bahagian daripadanya, maka ia tertolak. <br> <br>  (Riwayat al-Bukhari no. 2550, Muslim no. 4589 dan Abu Daud no. 4608) <br> <br>   Dalam riwayat Muslim, ada hadis lain berbunyi: <br> <br>  Barangsiapa yang mengerjakan suatu amalan yang tidak ada asal usul dengan agama kita, maka ia tertolak. <br><br><br>\nPokok Perbincangan Hadis :\n<br><br>\nLarangan mengada-adakan dalam urusan agama :\n<br><br>\n a) Dalam Ibadat :\n<br><br>\n(Sesuatu yang dibolehkan melakukannya dalam ibadat tertentu, tidak semestinya boleh dilakukan dalam ibadah lain pula.) (dedah kepala - ihram/ berdiri-azan)\n<br><br>\nIbadah yang langsung tidak syar'ie ( dengan hiburan/ tarian) - tidak diterima Allah bahkan ditutup pintu taubatnya\n<br><br>\nMenokok tambah dalam ibadat yang disyariatkan. (tambah rakaat dalam solat fardhu/ wudhu' empat empat)\n<br><br>\nMengurangkan sesuatu dari yang disyariatkan. (kurang rakaat dalam solat)\n<br><br>\n    b) Dalam Muamalat :\n\n<br><br>     i)  'Aqad yang dilarang oleh Syara' : <br>Barang yang hendak di'aqad tidak halal.\n         (nikah dengan mahram).\n     <br><br>ii)  'Aqad pada barang yang diharamkan<br> (arak/ bangkai).<br><br>\n     iii)  'Aqad yang menyebabkan berlaku zalim bagi sebelah pihak.<br>\n          (nikah anak perempuan tanpa izinnya).\n<br><br>\nPengajaran hadis:\n<br><br>\n - lslam adalah agama yang sudah sempurna dasar dan prinsipnya. la tidak perlu ditokok tambah lagi.<br>\n - Sebarang tokok tambah, ubah suai atau pengurangan yang bertentangan dengan usul agama adalah bid'ah yang diharamkan, yang ditolak dan sesat.<br>\n - Yang dimaksudkan dengan bid'ah ialah segala perkara yang tidak berdasarkan usul agama, seumpama mereka cipta cara beribadat tertentu, seperti sembahyang cara baru, upacara keagamaan baru dan sebagainya. <br>\n - Setiap muslim mestilah menjauhkan diri daripada terjebak dalam perbuatan bid'ah sesat, kerana ia boleh membawa kepada kehancuran diri, agama dan setengahnya pula membawa kepada kufur. <br>\n - Cukuplah baginya berpegang teguh dengan apa yang telah dibawa oleh Rasulullah SAW, demi menjamin kesejahteraan agamanya."
    },
    {
      "number": 6,
      "title": "Halal dan Haram",
      "arabicTitle": "",
      "imagePath": "assets/images/h6.jpg",
      "audioPath": "assets/audio/hadith6.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith6.png"
      ],
      "htmlDescription": "Daripada Abu Abdullah al-Nu'man ibn Basyer r.a. beliau berkata: Aku telah mendengar Rasulullah SAW bersabda: <br><br>\"Sesungguhnya perkara yang halal itu terang jelas, dan sesungguhnya perkara yang haram itu terang jelas, dan di antara kedua perkara tersebut ada perkara-perkara syubhat yang kesamaran yang kebanyakan orang tidak mengetahuinya. Barangsiapa yang menjaga perkara syubhat maka sesungguhnya dia telah membersihkan agamanya dan maruah dirinya. <br><br>Dan barangsiapa yang terjatuh dalam perkara syubhat, maka dia telah jatuh dalam perkara haram, umpama seorang pengembala yang mengembala di sekeliling kawasan larangan, dibimbangi dia akan menceroboh masuk ke dalamnya. Ketahuilah bahawa setiap raja ada sempadan dan sesungguhnya sempadan Allah itu ialah perkara yang diharamkanNya. Ketahuilah bahawa dalam setiap jasad itu ada seketul daging yang apabila ia baik maka baiklah seluruh jasad dan apabila ia rosak, maka rosaklah seluruh jasad. Ketahuilah ia adalah hati.\" <br><br>(Riwayat al-Bukhari no.52, Muslim no.1599 dan Abu Daud, no.3329,3330)\n\n<br><br><br>\nCatatan :\n<br><br>\n·    Hadits ini merupakan salah satu landasan pokok dalam syari’at. Abu Daud berkata : Islam itu berputar dalam empat hadits, kemudian dia menyebutkan hadits ini salah satunya.\n<br><br>\nPelajaran yang terdapat dalam hadits / الفوائد من الحديث :\n<br><br>\n1.     Antara sikap wara’ adalah meninggalkan syubhah .\n<br><br>\n2.     Banyak melakukan shubahat akan menjerumuskan seseorang kepada perbuatan haram.\n<br><br>\n3.     Menjauhkan diri daipada melakukan dosa kecil kerana hal tersebut dapat menyeret seseorang kepada perbuatan dosa besar.\n<br><br>\n4.     Memberikan perhatian terhadap masalah hati, kerana daripada hati punca tingkah laku seseorang.\n<br><br>\n5.     Baiknya amal perbuatan anggota badan merupakan pertanda baiknya hati.\n<br><br>\n6.     Pertanda ketakwaan seseorang jika dia meninggalkan perkara-perkara yang syubhah kerana khuatir akan terjerumus kepada hal-hal yang diharamkan.\n<br><br>\n7.     Berusaha menutup pintu terhadap peluang-peluang perbuatan haram.\n<br><br>\n8.     Hati-hati dalam masalah agama dan kehormatan serta tidak melakukan perbuatan-perbuatan yang dapat mendatangkan persangkaan buruk."
    },
    {
      "number": 7,
      "title": "Agama itu Nasihat",
      "arabicTitle": "",
      "imagePath": "assets/images/h7.jpg",
      "audioPath": "assets/audio/hadith7.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith7.png"
      ],
      "htmlDescription": "Daripada Abu Ruqaiyyah Tamim ibn Aus al-Daarie r.a. bahawa Nabi SAW telah bersabda: \"Agama itu adalah nasihat. Kami berkata: Untuk siapa? Baginda bersabda: Untuk Allah, untuk kitabNya, untuk RasulNya, untuk para lmam kaum muslimin dan untuk umat lslam seluruhnya.\" <br><br>(Riwayat Ahmad no. 16982, Muslim no. 55 dan Abu Daud no. 4944)<br><br><br>Pelajaran :\n<br><br>\n1.     Agama itu nasihat atau agama adalah nasihat bermaksud bahawa nssihat sebagai tiang agama, maka harus selalu saling menasihati diantara sesama  individu muslim.\n<br><br>\n2.     Nasihat wajib dilakukan sesuai kemampuannya."
    },
    {
      "number": 8,
      "title": "Kehormatan Muslim",
      "arabicTitle": "",
      "imagePath": "assets/images/h8.jpg",
      "audioPath": "assets/audio/hadith8.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith8.png"
      ],
      "htmlDescription": "Daripada lbnu 'Umar r.a. bahawa Rasulullah SAW telah bersabda: \"Aku telah diperintahkan supaya memerangi manusia sehingga mereka naik saksi bahawa sesungguhnya tiada Tuhan melainkan Allah dan bahawa sesungguhnya Muhammad utusan Allah, sehingga mereka mendirikan sembahyang dan membayar zakat. <br><br>Apabila mereka telah berbuat demikian, maka mereka telah memelihara darah mereka dan harta mereka daripada aku, melainkan dengan hak lslam, dan hisab perhitungan amal mereka terserah kepada Allah Ta'ala.\" <br><br> (Riwayat al-Bukhari no.25, Muslim no.22 dan Ahmad no. 68)<br><br><br>Pelajaran yang terdapat dalam hadits / الفوائد من الحديث :\n<br><br>\n1.     Pemerintah dibolehkan memerangi orang enggan membayar zakat.\n<br><br>\n2.     Diperbolehkannya membunuh orang yang mengingkari solat dan memerangi mereka yang menolak membayar zakat.\n<br><br>\n3.     Tidak diperbolehkan berlaku sewenang-wenang terhadap harta dan darah kaum muslimin.\n<br><br>\n4.     Diperbolehkannya hukuman  mati bagi setiap muslim jika dia melakukan perbuatan yang menuntut dijatuhkannya hukuman seperti itu seperti : <br>Berzina bagi orang yang sudah menikah (muhshan), membunuh orang lain dengan sengaja dan meninggalkan agamanya dan jamaahnya (murtad).\n<br><br>\n5.     Dalam hadits ini terdapat jawaban bagi kalangan murji’ah yang mengira bahawa iman tidak memerlukan amal perbuatan.\n<br><br>\n6.     Tidak mengkafirkan pelaku bid’ah yang menyatakan keesaan Allah dan menjalankan syari’atnya.\n<br><br>\n7.     Didalamnya terdapat dalil bahawa diterimanya amal yang zahir dan menghukum berdasarkan sesuatu yang zahir sementara yang tersembunyi terserah kepada Allah."
    },
    {
      "number": 9,
      "title": "Perintah dan Larangan",
      "arabicTitle": "",
      "imagePath": "assets/images/h9.jpg",
      "audioPath": "assets/audio/hadith9.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith9.png"
      ],
      "htmlDescription": "Daripada Abu Hurairah Abdul Rahman ibn Sokhrin r.a. beliau berkata: Aku telah mendengar Rasulullah SAW bersabda: <br><br> \"Apa-apa yang aku larang kamu melakukannya, maka hendaklah kamu menjauhinya, dan apa-apa yang aku perintahkan kamu melakukannya, maka lakukanlah seberapa daya kamu. Sesungguhnya umat yang terdahulu daripada kamu telah binasa lantaran banyak persoalan dan banyak perselisihan mereka terhadap Nabi-nabi mereka.\" <br><br>(Riwayat al-Bukhari, no. 6777 dan Muslim, no. 1337)<br><br><br>\nPelajaran :\n<br><br>\n1.     Wajibnya menghindari semua apa yang dilarang oleh Rasulullah Shallallahu’alaihi wasallam.\n<br><br>\n2.     Siapa yang tidak mampu melakukan perbuatan yang diperintahkan secara keseluruhan dan dia hanya mampu sebagiannya sahaja maka dia hendaknya melaksanakan apa yang dia mampu laksanakan.\n<br><br>\n3.     Allah tidak akan membebankan kepada seseorang kecuali sesuai dengan kadar kemampuannya.\n<br><br>\n4.     Perkara yang mudah tidak gugur karena perkara yang sukar.\n<br><br>\n5.     Menolak keburukan lebih diutamakan dari mendatangkan kemaslahatan.\n<br><br>\n6.     Larangan untuk saling bertikai dan anjuran untuk bersatu dan bersepakat.\n<br><br>\n7.     Sesuatu yang didiamkan itu merupakan rahmat bagi kamu, maka janganlah bertanyakan lagi seperti firman Allah yang bermaksud “Wahai orang yang beriman! Janganlah kamu bertanya tentang sesuatu yang jika dijelaskan kepada kamu, akan menyusahkan kamu.( Surah al-Mai’dah  5:101)"
    },
    {
      "number": 10,
      "title": "Rezeki yang Halal serta Doa yang Diterima",
      "arabicTitle": "",
      "imagePath": "assets/images/h10.jpg",
      "audioPath": "assets/audio/hadith10.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith10.png"
      ],
      "htmlDescription": "Daripada Abu Hurairah r.a beliau berkata: Rasulullah SAW telah bersabda: <br><br> \"Sesungguhnya Allah Ta'ala baik, Dia tidak menerima kecuali perkara yang baik. Dan sesungguhnya Allah telah memerintahkan orang-orang mukmin dengan apa yang telah diperintahkan kepada para Rasul di mana Allah Ta'ala berfirman: (Wahai para Rasul! Makan minumlah kamu makanan yang baik-baik dan hendaklah kamu beramal soleh). (Surah al-Mukminun 23:51) <br><br> Dan Allah Ta'ala berfirman: (Wahai orang-orang yang beriman! Makan minumlah kamu makanan yang baik-baik yang Kami rezekikan kepada kamu).(Surah al-Baqarah 2:172) <br><br> Kemudian Baginda menyebut perihal seorang lelaki yang bermusafir jauh, yang berambut kusut masai dan berdebu, yang menadah tangan ke langit (iaitu berdoa): <br><br> Wahai Tuhanku! Wahai Tuhanku! Bagaimanakah doanya akan dimakbulkan sedangkan makanannya haram, minumannya haram, pakaiannya haram dan dia dikenyangkan dengan makanan yang haram?\" <br><br> (Riwayat Ahmad no. 8348, Muslim no. 1015 dan al-Tirmizi no. 2922) <br><br><br>\nPelajaran :\n<br><br>\n1.     Dalam hadits diatas terdapat pelajaran akan sucinya Allah ta’ala dari segala kekurangan dan cela.\n<br><br>\n2.     Allah ta’ala tidak menerima kecuali sesuatu yang baik. Maka siapa yang bersedekah dengan barang haram tidak akan diterima.\n<br><br>\n3.     Sesuatu yang disebut baik adalah apa yang dinilai baik disisi Allah ta’ala.\n<br><br>\n4.     Berterusan seseorang dalam perbuatan haram akan menghalangi seseorang dari terkabulnya doa.\n<br><br>\n5.     Orang yang melakukan maksiat tidak termasuk mereka yang dikabulkan doanya kecuali mereka yang Allah kehendaki.\n<br><br>\n6.     Makan barang haram dapat merosakkan amalan dan menjadi penghalang diterimanya amal perbuatan.\n<br><br>\n7.     Anjuran untuk berinfaq dari barang yang halal dan larangan untuk berinfaq dari sesuatu yang haram.\n<br><br>\n8.     Seorang hamba akan diberi ganjaran jika memakan sesuatu yang baik dengan maksud agar dirinya diberi kekuatan untuk ta’at kepada Allah.\n<br><br>\n9.     Doa orang yang sedang safar dan yang hatinya sangat mengharap akan terkabul.\n<br><br>\n10.   Antara sebagian dari sebab-sebab dikabulkannya do’a : Sedang bermusafir, hati yang sangat-sangat berharap, keadaan bersahaja ketika berdoa, mengangkat kedua-dua tangan ke langit, merayu ketika berdoa, menjaga makan dan minum daripada sumber yang halal, memakai pakaian yang halal"
    },
    {
      "number": 11,
      "title": "Tinggalkanlah Keraguan",
      "arabicTitle": "",
      "imagePath": "assets/images/h11.jpg",
      "audioPath": "assets/audio/hadith11.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith11.png"
      ],
      "htmlDescription": "Daripada Abu Muhammad al-Hasan ibn Ali ibn Abu Talib r.a., cucu Rasulullah SAW dan orang kesayangan Baginda. Beliau berkata: <br><br>Aku telah menghafal daripada Rasulullah SAW hadis: \"Tinggalkanlah apa yang meragukan engkau kepada apa yang tidak meragukan engkau.\" <br><br>(Riwayat al-Tirmizi no. 2518, al-Nasa’i no. 5711,8/327-328, Ibn Hibban dan al-Hakim)<br><br><br>Pelajaran:\n<br><br>\n1.     Meninggalkan syubhah dan mengambil yang halal akan melahirkan sikap wara’.\n<br><br>\n2.     Keluar dari ikhtilaf ulama lebih utama kerana hal tersebut lebih terhindar dari perbuatan syubhah, khususnya jika diantara pendapat mereka tidak ada yang dapat dikuatkan.\n<br><br>\n3.     Jika keraguan bertentangan dengan keyakinan maka keyakinan yang diambil.\n<br><br>\n4.     Sebuah perkara harus jelas berdasarkan keyakinan dan ketenangan. Tidak ada harganya keraguan dan kebimbangan.\n<br><br>\n5.     Berhati-hati dari sikap meremehkan terhadap urusan agama dan masalah bid’ah.\n<br><br>\n6.     Siapa yang membiasakan perkara syubhah maka dia akan berani melakukan perbuatan yang haram."
    },
    {
      "number": 12,
      "title": "Tinggalkanlah apa yang tidak bermanfaat",
      "arabicTitle": "",
      "imagePath": "assets/images/h12.jpg",
      "audioPath": "assets/audio/hadith12.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith12.png"
      ],
      "htmlDescription": "Daripada Abu Hurairah r.a beliau berkata: Rasulullah SAW telah bersabda:<br> \"Sebahagian daripada keelokan seorang mukmin ialah meninggalkan apa yang tidak berfaedah baginya.\" <br><br> (Riwayat al-Tirmizi no. 2318, Ibn Majah no. 3976, Ahmad no. 1732 dan al-Baihaqi)<br><br><br>Pelajaran:\n<br><br>\n1.     Antara sifat-sifat seorang muslim adalah dia sentiasa menyibukkan dirinya dengan perkara-perkara yang mulia serta menjauhkan perkara yang hina dan rendah moral.\n<br><br>\n2.     Mendidik diri dan merawatannya dengan meninggalkan perkara-perkara yang tidak bermanfaat didalamnya.\n<br><br>\n3.     Menyibukkkan diri dengan sesuatu yang tidak bermanfaat adalah kesia-siaan dan merupakan pertanda kelemahan iman.\n<br><br>\n4.     Dianjurkan untuk memanfaatkan waktu dengan sesuatu yang manfaatnya kembali kepada diri sendiri bagi dunia ataupun akhirat.\n<br><br>\n5.     Ikut campur terhadap sesuatu yang bukan urusannya dapat mengakibatkan kepada perpecahan dan pertikaian diantara manusia."
    },
    {
      "number": 13,
      "title": "Kasih mengasihi sesama Islam",
      "arabicTitle": "",
      "imagePath": "assets/images/h13.jpg",
      "audioPath": "assets/audio/hadith13.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith13.png"
      ],
      "htmlDescription": "Daripada Abu Hamzah Anas ibn Malik r.a., khadam Rasulullah SAW, daripada Nabi SAW, Baginda bersabda: <br>\"Seseorang kamu tidak benar-benar beriman sehingga dia mengasihi saudaranya sebagaimana dia mengasihi dirinya sendiri.\" <br><br> (Riwayat al-Bukhari no.13, Muslim no.45 dan Ahmad no. 18076) <br><br><br>Pelajaran yang terdapat dalam hadits / الفوائد من الحديث :\n<br><br>\n1.       Seorang mu’min dengan mu’min yang lainnya bagaikan satu jiwa, jika dia mencintai saudaranya maka seakan-akan dia mencintai dirinya sendiri.\n<br><br>\n2.     Menjauhkan perbuatan hasad (dengki) dan kerana hal tersebut bertentangan dengan kesempurnaan iman.\n<br><br>3.     Iman dapat bertambah dan berkurang, bertambah dengan ketaatan dan berkurang dengan kemaksiatan.\n<br><br>\n4.     Dianjurkan untuk bersatu hati sesama umat Islam."
    },
    {
      "number": 14,
      "title": "Larangan berzina, Membunuh dan Murtad",
      "arabicTitle": "",
      "imagePath": "assets/images/h14.jpg",
      "audioPath": "assets/audio/hadith14.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith14.png"
      ],
      "htmlDescription": "Daripada lbnu Mas'uud r.a. beliau berkata: Rasulullah SAW telah bersabda: <br>\"Tidak halal darah seorang muslim yang bersaksi bahawa tidak ada yang disembah melainkan Allah dan aku adalah utusan Allah kecuali kerana salah satu daripada tiga perkara : <br><br>Berzina, pada hal dia sudah berkahwin, membunuh orang dan meninggalkan agamanya serta memisahkan diri daripada jemaah (murtad).” <br><br> (Riwayat al-Bukhari, dan Muslim) <br><br><br>Pelajaran yang terdapat dalam hadits / الفوائد من الحديث :\n<br><br>\n1.     Tidak boleh menumpahkan darah kaum muslimin kecuali dengan tiga sebab, iaitu : zina muhsan (orang yang sudah berkahwin/menikah), membunuh manusia dengan sengaja dan meninggalkan agamanya (murtad) berpisah dari jamaah kaum muslimin.\n<br><br>\n2.     Islam sangat menjaga kehormatan, nyawa dan agama dengan menjatuhkan hukuman mati kepada mereka yang mengganggunya seperti dengan melakukan zina, pembunuhan dan murtad.\n<br><br>\n3.     Sesungguhnya agama yang disepakati adalah yang dipegang oleh jamaah kaum muslimin, maka wajib dijaga dan tidak boleh keluar darinya.\n<br><br>\n4.     Hukum jenayah dalam Islam sangat keras, hal itu bertujuan untuk mencegah (preventive) dan melindungi.\n<br><br>\n5.     Pendidikan bagi masyarakat untuk takut kepada Allah ta’ala dan selalu merasa diawasi oleh-Nya dan keadaan tersembunyi atau terbuka sebelum dilaksanakannya hukuman.\n<br><br>\n6.     Hadits diatas menunjukkan pentingnya menjaga kehormatan dan kesucian di, keluarga dan masyarakat.\n<br><br>\n7.     Dalam hadits tersebut merupakan ancaman bagi siapa yang membunuh manusia yang diharamkan oleh Allah ta’ala."
    },
    {
      "number": 15,
      "title": "Adab orang mukmin",
      "arabicTitle": "",
      "imagePath": "assets/images/h15.jpg",
      "audioPath": "assets/audio/hadith15.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith15.png"
      ],
      "htmlDescription": "Daripada Abu Hurairah r.a., bahawa Rasulullah SAW telah bersabda: \"Barangsiapa yang beriman dengan Allah dan hari akhirat, maka hendaklah dia berkata baik atau dia diam. Barangsiapa yang beriman dengan Allah dan hari akhirat, maka hendaklah dia memuliakan jiran tetangganya. Barangsiapa yang beriman dengan Allah dan hari akhirat, maka hendaklah dia memuliakan tetamunya.\"   <br><br> (Riwayat al-Bukhari, no. 5672 dan Muslim, no. 47)<br><br><br>Pelajaran :\n<br><br>\n1.     Iman berkait secara langsung dengan kehidupan seharian.\n<br><br>\n2.     Islam menyerukan tindakan yang dapat menumbuhkan rasa cinta dan kasih sayang dikalangan individu individu masyarakat muslim.\n<br><br>\n3.     Termasuk dalam kesempurnaan iman adalah berkata perkataan yang baik dan diam dari selainnya .\n<br><br>\n4.     Berlebih-lebihan dalam pembicaraan dapat menyebabkan kehancuran, sedangkan menjaga pembicaraan merupakan jalan keselamatan.\n<br><br>\n5.     Islam sangat menjaga agar seorang muslim berbicara apa yang bermanfaat dan mencegah perkataan yang diharamkan dalam setiap keadaan.\n<br><br>\n6.     Jangan berlebih-lebihan ketika berbicara, kerana dikhuatiri hal tersebut dapat menyeret kepada perbuatan yang diharamkan atau yang makruh.\n<br><br>\n7.     Termasuk kesempurnaan iman adalah menghormati tetangganya dan memperhatikan harta dan membantunya serta tidak menyakitinya.\n<br><br>\n8.     Wajib berbicara apabila diperlukan, khususnya jika bertujuan menerangkan yang haq (benar) dan beramar ma’ruf nahi munkar.\n<br><br>\n9.     Memuliakan tetamu termasuk diantara kemuliaan akhlak dan pertanda komitmen diri terhadap syariat Islam. Rasulullah SAW bersabda yang bermaksud: “Menjamu tamu sehari semalam adalah kewajiban bagi setiap Muslim”\n<br><br>\n10. Anjuran untuk melayani orang lain dengan baik."
    },
    {
      "number": 16,
      "title": "Jangan marah",
      "arabicTitle": "",
      "imagePath": "assets/images/h16.jpg",
      "audioPath": "assets/audio/hadith16.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith16.png"
      ],
      "htmlDescription": "Daripada Abu Hurairah r.a.: Bahawa seorang lelaki berkata kepada Nabi SAW: Berikan daku wasiat. Baginda bersabda: \"Janganlah engkau marah.\" Lelaki itu mengulangi soalan itu beberapa kali. Baginda tetap bersabda: \"Janganlah engkau marah.\" <br><br> (Riwayat Ahmad no. 8729, al-Bukhari no. 5765 dan al-Tirmizi no. 2020)<br><br><br>\nPelajaran yang terdapat dalam hadits / الفوائد من الحديث :\n<br><br>\n1.     Anjuran bagi setiap muslim untuk memberikan nasihat dan mengenal perbuatan-perbuatan kebajikan, menambah wawasan ilmu yang bermanfaat serta memberikan nasihat yang baik.\n<br><br>\n2.     Diriwayatkan daripada Nabi Muhammad SAW bahawa baginda bersabda: “ Sesiapa yang menahan marahnya padahal dia boleh melepaskannya, kelak Allah akan memanggilnya pada hari kiamat di hadapan segala makhluk, sehingga dia diberi hak hak unutk memilih bidadari yang disukainya.”\n<br><br>\n3.     Sabda Nabi Muhammad SAW yang bermaksud: “Bukanlah dikatakan orang kuat kerana dapat menumbangkan lawannya, tetapi orang kuat ialah orang yang mampu mengendalikan hawa nafsunya di waktu marah.”\n\n<br><br>\nLangkah menghadapi kemarahan\n<br>\n<br>1.         Jauhi akhlak tercela dan didiklah diri dengan akhlak mulia.\n<br>2.         Berlatih memaafkan orang lain.\n<br>3.         Bersikap tawaduk\n<br>4.         Mengucapkan ta’awwuz\n<br>5.      Mengubah posisi ketika marah daripada berdiri kepada duduk, daripada duduk kepada berbaring.<br>\n6.         Berhenti becakap\n<br>7.         Mengambil wuduk"
    },
    {
      "number": 17,
      "title": "Berbuat baik dalam semua urusan",
      "arabicTitle": "",
      "imagePath": "assets/images/h17.jpg",
      "audioPath": "assets/audio/hadith17.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith17.png"
      ],
      "htmlDescription": "Daripada Abu Ya'la Syaddad ibn Aus r.a. daripada Rasulullah SAW, bahawa Baginda bersabda: <br>\"Sesungguhnya Allah menulis (iaitu mewajibkan) Ehsan atas segala sesuatu. Apabila kamu mahu membunuh, maka perelokkanlah pembunuhan itu. Apabila kamu mahu menyembelih, maka perelokkanlah penyembelihan itu dan hendaklah kamu menajamkan mata pisau dan hendaklah dia menyenangkan haiwan sembelihannya itu.\"      <br> <br>  (Riwayat Ahmad no. 17154, Muslim no. 1955, Abu Daud no. 2815, al-Tirmizi, Ibn Majah no. 3170, al-Nasa’i no. 4405 dan al-Baihaqi no. 11071)\n\n<br><br><br>Pokok Perbincagan Hadis :\n<br><br>\n1.     Syariat Islam menuntut perbuatan ihsan kepada setiap makhluk contohnya dalam hukuman bunuh atau qisas atau ketika menyembelih haiwan.\n<br><br>\n2.     Dalam hukuman bunuh , perlu tiada unsur penganiayaan, menyegerakan kematian, memancung tengkuk sebagaimana  sabit dalam al-Quran dan beberapa hadis Baginda, serta menajamkan mata pedang akan digunakan terlebih dahulu.\n<br><br>\n3.     Termasuk ihsan juga berbuat baik terhadap haiwan ternak dan belas kasih terhadapnya.  Ketika menyembelih, hendaklah menyegerakan kematiannya,<br> menggunakan mata pisau yang benar-benar tajam, menyembelih dengan lemah lembut, tidak merebahkan haiwan sembelihan ke tanah dengan kasar, tidak menyeretnya, menghadapkannya ke kbilat, membaca basmallah dan hamdallah, memotong urat nadi lehernya serentak (halqum, marih dan wudjin),membiarkan mati barulah dilapah.\n<br><br>\n4.     Menyusukuri nikmat dan pemberian Allah yang telah menundukkan haiwan tersebut agar mudah untuk disembelih dan telah menghalalkan dagingnya."
    },
    {
      "number": 18,
      "title": "Taqwa & Taubat",
      "arabicTitle": "",
      "imagePath": "assets/images/h18.jpg",
      "audioPath": "assets/audio/hadith18.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith18.png"
      ],
      "htmlDescription": "Daripada Abu Zar Jundub ibn Junadah dan Abu Abdul Rahman Mu'az ibn Jabal, r.a., daripada Rasulullah SAW, bahawa Baginda bersabda:<br> \"Bertaqwalah engkau kepada Allah walaupun di mana engkau berada, dan iringilah kejahatan dengan kebaikan, nescaya ia akan menghapuskan kejahatan tersebut dan bergaullah sesama manusia dengan budi pekerti yang baik.\" <br><br>  (Riwayat Ahmad no. 21392, al-Tirmizi no. 1988 dan al-Hakim no. 178)\n\n<br><br><br>\nPelajaran yang terdapat dalam hadits / الفوائد من الحديث :\n<br><br>\n1.     Takwa kepada Allah merupakan kewajiban setiap muslim dan ia merupakan asas diterimanya amal soleh.\n<br><br>\n2.     Bersegera melakukan ketaatan dengan bertaubat setelah melakukan keburukan secara langsung kerana taubat adalah syarat menghapus dosa-dosa besar. Perbuatan buruk hendaklah dibalas dengan kebaikan seperti kemaafan, kerana kebaikan akan menghapus keburukan.\n<br><br>\n3.     Bersungguh-sungguh menghias diri dengan akhlak mulia dengan mencontohi akhlak Rasulullah SAW. Rasulullah SAW bersabda yang bermaksud : “ Sesungguhnya aku diutuskan untuk menyempurnakan akhlak yang mulia.” (Riwayat al-Baihaqi no. 21301)\n<br><br>\n4.     Menjaga batas-batas pergaulan yang baik merupakan kunci kejayaan, kebahagiaan dan ketenangan di dunia dan akhirat."
    },
    {
      "number": 19,
      "title": "Tawakkal kepada Allah",
      "arabicTitle": "",
      "imagePath": "assets/images/h19.jpg",
      "audioPath": "assets/audio/hadith19.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith19.png"
      ],
      "htmlDescription": "Daripada Abu al-'Abbas, Abdullah ibn Abbas, r.a. beliau berkata: \"Aku pernah duduk di belakang Nabi SAW pada suatu hari, lalu Baginda bersabda kepadaku: <br>“Wahai anak! Sesungguhnya aku mahu ajarkan engkau beberapa kalimah:<br> Peliharalah Allah nescaya Allah akan memeliharamu. Peliharalah Allah nescaya engkau akan dapati Dia di hadapanmu. Apabila engkau meminta, maka pintalah dari Allah. Apabila engkau meminta pertolongan, maka mintalah pertolongan dengan Allah. <br>Ketahuilah bahawa kalau umat ini berkumpul untuk memberikan sesuatu manfaat kepadamu, mereka tidak akan mampu memberikanmu manfaat kecuali dengan suatu perkara yang memang Allah telah tentukan untukmu. <br>Sekiranya mereka berkumpul untuk memudharatkan kamu dengan suatu mudharat, nescaya mereka tidak mampu memudharatkan kamu kecuali dengan suatu perkara yang memang Allah telah tentukannya untukmu. Pena-pena telah diangkatkan dan lembaran-lembaran telah kering (dakwatnya).\"      <br> <br>  (Riwayat Ahmad no. 2669, al-Tirmizi no. 2516 dan al-Hakim no. 6302) <br> <br>  Dalam riwayat selain Imam al-Tirmizi disebutkan : “Jagalah Allah nescaya engkau mendapati-Nya di hadapanmu; kenalilah Allah pada waktu lapang nescaya Dia mengenalimu pada waktu kesusahan. <br>Ketahuilah, bahawa apa yang luput daripadamu tidak bakal mengenaimu, dan apa yang mengenaimu tidak bakal luput daripadamu. Ketahuilah bahawa bersama kesabaran ada kemenangan; bersama kesusahan ada jalan keluar; dan bersama kesulitan ada kemudahan.”\n<br><br><br>\nPelajaran yang terdapat dalam hadits / الفوائد من الحديث :\n<br><br>\n1.     “Dan sesiapa bertawakal keapda Allah, maka Allah pasti akan memberinya kecukupan.” ( Surah al-Talaq 65: 3)\n<br><br>\n2.     Antara ciri-ciri menuntut ilmu adalah berusaha menuntut ilmu dengan penuh keinginan dan rasa ingin tahu.\n<br><br>\n3.     Siapa yang istiqamah melaksanakan perintah-perintah Allah, nicsaya Allah akan menjaganya di dunia dan akhirat.\n<br><br>\n4.     Beramal soleh serta melaksanakan perintah Allah akan dapat mengelak dariapada bencana dan mendapat pertolongan Allah dariapda kesulitan.\n<br><br>\n5.     Hanya kepada Allah SWT kita memohon segala bentuk pertolongan dan jangan meminta dariapda apa pun selain Allah SWT.\n<br><br>\n6.     Manusia tidak akan mengalami musibah kecuali berdasarkan ketetapan Allah ta’ala . Orang yang selalu bersyukur akan mendapat perhatian, pertolongan dan perlindungan dariapda Allah SWT.\n<br><br>\n7.     Menghormati waktu dan menggunakannya kepada sesuatu yang bermanfaat  sebagaimana Rasulullah shollallohu ‘alaihi wa sallam memanfaatkan waktunya saat beliau berkendaraan. Gunakan masa muda sebaik mungkin dengan menuntut ilmu yang bermanfaat."
    },
    {
      "number": 20,
      "title": "Sifat malu",
      "arabicTitle": "",
      "imagePath": "assets/images/h20.jpg",
      "audioPath": "assets/audio/hadith20.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith20.png"
      ],
      "htmlDescription": "Daripada Abu Mas'uud 'Uqbah ibn 'Amru al-Ansarie al-Badrie r.a. beliau berkata: Rasulullah SAW telah bersabda: <br> \"Sesungguhnya antara kata-kata ungkapan Kenabian terdahulu yang dapat diketahui dan dipetik oleh manusia ialah: Jika engkau tidak malu, maka lakukanlah apa sahaja yang engkau mahu.\"               <br> <br>  (Riwayat al-Bukhari, no. 3296 dan Abu Daud, no. 4796)<br><br><br>\nPelajaran yang terdapat dalam hadits / الفوائد من الحديث :\n<br><br>\n1.     Malu merupakan tema yang telah disepakati oleh para nabi dan tidak terhapus ajarannya.\n<br><br>\n2.     Jika seseorang telah meninggalkan rasa malu, maka jangan harap lagi (kebaikan) darinya sedikitpun.\n<br><br>\n3.     Malu merupakan landasan akhlak mulia dan selalu berpaksikan kepada kebaikan. Siapa yang banyak malunya lebih banyak kebaikannya, dan siapa yang sedikit rasa malunya semakin sedikit kebaikannya.\n<br><br>\n4.     Rasa malu merupakan prilaku dan dapat dibentuk. Maka setiap orang yang memiliki tanggung jawab hendaknya memperhatikan bimbingan terhadap mereka yang menjadi tanggung jawabnya.\n<br><br>\n5.     Tidak ada rasa malu dalam mengajarkan hukum-hukum agama serta menuntut ilmu dan kebenaran . Allah ta’ala berfirman :<br> “ Dan Allah tidak malu daripada menyatakan kebenaran “ (Surah al-Ahzab 33 : 53).\n<br><br>\n6.     Diantara manfaat rasa malu adalah  ‘Iffah (menjaga diri dari perbuatan tercela) dan Wafa’ (menepati janji)\n<br><br>\n7.     Rasa malu merupakan cabang iman yang wajib diamalkan. Sabda Nabi Muhammad SAW “ Malu itu sebahagian daripada iman.” (Riwayat al-Bukhari no.24 dan Muslim no. 36)"
    },
    {
      "number": 21,
      "title": "Sifat istiqamah",
      "arabicTitle": "",
      "imagePath": "assets/images/h21.jpg",
      "audioPath": "assets/audio/hadith21.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith21.png"
      ],
      "htmlDescription": "Daripada Abu `Amru - atau digelar juga Abu `Amrah - Sufian ibn Abdullah r.a. beliau berkata: <br> \"Aku berkata: Wahai Rasulullah! Ajarkan untukku dalam lslam suatu ucapan yang aku tidak perlu lagi bertanya kepada orang lain selainmu. Baginda bersabda: Ucapkanlah: Aku beriman kepada Allah. Kemudian hendaklah engkau beristiqamah.\"     <br> <br>  (Riwayat Muslim no. 38; al-Nasa’i no. 11489 dan Ibn Majah no. 3972)<br><br><br>\nPelajaran yang terdapat dalam hadits / الفوائد من الحديث :\n<br><br>\n1.     Beriman kepada Allah ta’ala harus mendahului ketaatan.\n<br><br>\n2.     Amal soleh dapat menjaga keimanan\n<br><br>\n3.     Iman dan amal soleh harus dilaksanakan bersama-sama\n<br><br>\n4.     Istiqamah merupakan darjat yang tinggi.\n<br><br>\n5.     Para sahabat memiliki keinginan yang kuat dalam menjaga agama dan meningkatkan keimanan mereka\n<br><br>\n6.     Firman Allah: “Maka hendaklah kamu beristiqamah seperti yang diperintahkan kepadamu” (Surah Hud 11: 112)\n<br><br>\n7.     Perintah untuk istiqomah dalam tauhid dan ikhlas beribadah hanya kepada Allah semata hingga mati.\n<br><br>\n8.     Firman Allah: “Sesungguhnya mereka yang berkata: Allah adalah Tuhan kami kemudian mereka istiqamah..” (Surah Fussilat 41: 30)\n<br><br>\n9.     Firman Allah: “Sesungguhnya orang yang menyatakan: Tuhan kami adalah Allah. Kemudian mereka tetap istiqamah maka tidak ada kekhuatiran terhadap mereka dan tidak pula mereka berduka cita (Surah Ahqaf 33: 13)\n<br><br>\n10.     Umar bin Khattab berkata: “Mereka (para sahabat) istiqamah demi Allah dalam mentaati Allah dan tidak sedikit pun mereka itu berpaling, sekalipun seperti berpalingnya musang.”"
    },
    {
      "number": 22,
      "title": "Allah Maha Pemurah",
      "arabicTitle": "",
      "imagePath": "assets/images/h22.jpg",
      "audioPath": "assets/audio/hadith22.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith22.png"
      ],
      "htmlDescription": "Daripada Abu Abdullah Jabir ibn Abdullah al-Ansarie r.a., (beliau meriwayatkan): Bahawa seorang lelaki telah bertanyakan Rasulullah SAW, dia berkata: <br> <br> \"Bagaimana pandanganmu jika aku mendirikan sembahyang-sembahyang fardhu, aku berpuasa bulan Ramadhan, aku menghalalkan perkara yang halal dan aku mengharamkan perkara yang haram. Aku tidak akan menambah apa-apa lagi lebih daripada itu. Apakah aku akan masuk syurga?\" Baginda bersabda: \"Ya!\"               <br> <br>  (Riwayat Ahmad dan Muslim, no. 15)<br><br><br>\nCatatan :\n<br><br>\nYang bertanya ialah : Nu’man bin Qauqal(sahabat) - menyertai perang Badar/syahid dalam perang Uhud.Keimanannya terhadap syurga dan apa yang dijanjikan oleh Allah telah mendorong beliau untuk bertanya Nabi tentang hadis ini.\n<br><br>\nPelajaran yang terdapat dalam hadits / الفوائد من الحديث:\n<br><br>\n1.     Setiap muslim dituntut untuk bertanya kepada ulama tentang syariat Islam, tentang kewajibannya dan apa yang dihalalkan dan diharamkan baginya jika hal tersebut tidak diketahuinya.\n<br><br>\n2.     Penghalalan dan pengharaman merupakan aturan syariat, tidak ada yang berhak menentukannya kecuali Allah ta’ala.\n<br><br>\n3.     Amal soleh merupakan sebab masuknya seseorang kedalam syurga.\n<br><br>\n4.     Keinginan dan perhatian yang besar dari para sahabat serta kerinduan mereka terhadap syurga serta upaya mereka dalam mencari jalan untuk sampai ke sana.\n<br><br>\n5.     Hadis menerangkan betapa apabila seorang mukmin benar-benar menunaikan segala tanggungjawab agama yang fardhu dengan sempurna, menghalalkan perkara yang halal dan mengharamkan perkara yang haram, dia akan masuk syurga walaupun dia tidak melakukan amalan-amalan sunat yang lain. lni adalah kemurahan dan rahmat Allah SWT terhadap hamba-hambaNya."
    },
    {
      "number": 23,
      "title": "Kebersihan dan Iman",
      "arabicTitle": "",
      "imagePath": "assets/images/h23.jpg",
      "audioPath": "assets/audio/hadith23.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith23.png"
      ],
      "htmlDescription": "Daripada Abu Malik al-Haris ibn `Asim al-Asya'arie r.a. beliau berkata: Rasulullah SAW telah bersabda: <br> \"Kebersihan itu sebahagian daripada iman. Ucapan zikir al-Hamdulillah memenuhi neraca timbangan. <br> Ucapan zikir Subhaanallah dan al-Hamdulillah kedua-duanya memenuhi ruangan antara langit dan bumi. <br> Sembahyang itu adalah cahaya. Sedekah itu adalah saksi. Sabar itu adalah sinaran. Al-Qur'an itu adalah hujah bagimu atau hujah ke atasmu. <br> Setiap manusia keluar waktu pagi, ada yang menjual dirinya, ada yang memerdekakan dirinya dan ada pula yang mencelakakan dirinya.\" <br> <br>  (Riwayat Muslim no.223 dan al-Tirmizi no.3517)<br><br><br>\nPelajaran yang terdapat dalam hadits /  الفوائد من الحديث :\n<br><br>\n1.     Iman merupakan ucapan dan perbuatan, bertambah dengan amal shalih dan keta’atan dan berkurang dengan maksiat dan dosa.\n<br><br>\n2.     Amal perbuatan akan ditimbang pada hari kiamat dan ia memiliki beratnya.\n<br><br>\n3.     Bersuci merupakan syarat sahnya ibadah, kerana itu harus diambil perhatian.\n<br><br>\n4.     Menjaga solat akan mendatangkan petunjuk dan memperbaiki diri seorang muslim terhadap manusia, membezakannya dengan akhlaknya dan perilakunya, kewara’annya dan ketakwaannya.\n<br><br>\n5.     Seruan untuk berinfaq pada jalan-jalan kebaikan dan bersegera melakukannya dimana hal tersebut merupakan pertanda benarnya keimanan.\n<br><br>\n6.     Anjuran untuk bersabar tatkala mengalami musibah, khususnya apa yang dialami seorang muslim karena perbuatan amar ma’ruf nahi munkar.\n<br><br>\n7.     Semangat membaca Al Quran dengan pemahaman dan mentadabburi (merenungkan) maknanya, mengamalkan kandungan-kandungannya kerana hal tersebut dapat memberi syafaat bagi seorang hamba pada hari kiamat.\n<br><br>\n8.       Seorang muslim harus menggunakan waktunya dan umurnya dalam ketaatan kepada Allah ta’ala serta tidak mengabaikannya kerana kesibukan lainnya."
    },
    {
      "number": 24,
      "title": "Larangan berlaku zalim",
      "arabicTitle": "",
      "imagePath": "assets/images/h24.jpg",
      "audioPath": "assets/audio/hadith24.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith24.png",
        "assets/images/hadith24_2.png"
      ],
      "htmlDescription": "Daripada Abu Zar al-Ghifari r.a. daripada Rasulullah SAW berdasarkan apa yang diriwayatkan oleh Baginda daripada Allah SWT bahawa Dia berfirman: <br> <br> <br>   \"Wahai hamba-hambaKu! Sesungguhnya aku mengharamkan ke atas diriKu kezaliman dan Aku jadikannya di kalangan kamu sebagai suatu perkara yang diharamkan, maka janganlah kamu saling zalim-menzalimi.\"  <br> <br> <br>  \"Wahai hamba-hambaKu! Kamu semua sesat kecuali orang yang Aku hidayatkannya, maka hendaklah kamu meminta hidayat dariKu.\"  <br> <br> <br>  \"Wahai hamba-hambaKu! Kamu semua lapar kecuali orang yang Aku beri makan, maka hendaklah kamu meminta makan daripadaKu nescaya Aku akan berikan kamu makan.\" <br> <br> <br>   \"Wahai hamba-hambaKu! Kamu semua telanjang kecuali orang yang Aku berikannya pakaian, maka hendaklah kamu meminta pakaian daripadaKu nescaya Aku akan berikan kamu pakaian.\"  <br> <br> <br>  \"Wahai hamba-hambaKu! Sesungguhnya kamu bersalah siang dan malam dan Aku mengampunkan semua dosa, maka mintalah keampunan daripadaKu nescaya Aku akan ampunkan kamu.\"  <br> <br> <br>  \"Wahai hamba-hambaKu! Selama-lamanya kamu tidak akan mampu memudharatkan Aku sehingga kamu boleh memudharatkan Aku.\" <br> <br> <br>   \"Wahai hamba-hambaKu! Dan selama-lamanya kamu tidak akan mampu memberi manfaat kepada Aku sehingga kamu boleh memberi manfaat kepada Aku.\"  <br> <br> <br>  \"Wahai hamba-hambaKu! Sekiranya orang-orang yang terdahulu dan terkemudian dari kamu, manusia dan jin di kalangan kamu, sekiranya mereka semua mempunyai hati bertaqwa umpama hati orang yang paling bertaqwa di kalangan kamu, nescaya hal itu tidak menambahkan apa-apapun dalam kerajaanKu.\"  <br> <br> <br>  \"Wahai hamba-hambaKu! Sekiranya orang-orang yang terdahulu dan terkemudian dari kamu, manusia dan jin di kalangan kamu, sekiranya mereka semua mempunyai hati jahat umpama hati orang yang paling jahat di kalangan kamu, nescaya hal itu tidak mengurang-cacatkan apa-apapun dalam kerajaanKu.\"  <br> <br> <br> \"Wahai hamba-hambaKu! Sekiranya orang-orang yang terdahulu dan terkemudian dari kamu, manusia dan jin di kalangan kamu, sekiranya mereka semua berhimpun di suatu tempat, lalu mereka meminta daripadaKu (iaitu meminta sesuatu pemberian), lantas Aku kurniakan setiap orang dari kalangan mereka permintaannya, nescaya hal itu tidak mengurangkan sedikitpun apa-apa yang ada di sisiKu kecuali umpama berkurangnya air laut apabila dicelupkan sebatang jarum.\" <br> <br> <br>   \"Wahai hamba-hambaKu! Bahawa sesungguhnya hanya amalan kamu yang Aku akan perhitungkannya bagi kamu, kemudian Aku sempurnakan pembalasannya. Maka barangsiapa yang mendapat kebaikan maka hendaklah dia memuji Allah dan barangsiapa yang mendapat selain kebaikan, maka janganlah dia mencela kecuali mencela dirinya sendiri.\"            <br> <br>   (Riwayat al-Bukhari dalam al-Adab al-Mufrad dan Muslim no. 2577) <br><br><br> Pelajaran yang terdapat dalam hadits / الفوائد من الحديث:\n<br><br>\n1.     Menegakkan keadilan di antara manusia serta haramnya berlaku zalim di antara mereka merupakan tujuan dari ajaran Islam yang paling penting.\n<br><br>\n2.     Wajib bagi setiap orang untuk memudahkan jalan petunjuk dan memintanya kepada Allah ta’ala.\n<br><br>\n3.     Semua makhluk sangat bergantung kepada Allah dalam mendatangkan kebaikan dan menolak keburukan terhadap dirinya baik dalam perkara dunia mahupun akhirat.\n<br><br>\n4.     Pentingnya istighfar dari perbuatan dosa dan sesungguhnya Allah ta’ala akan mengampuninya.\n<br><br>\n5.     Lemahnya makhluk dan ketidakmampuan mereka dalam mendatangkan kecelakaan dan kemanfaatan.\n<br><br>\n6.     Wajib bagi setiap mu’min untuk bersyukur kepada Allah ta’ala atas ni’mat-Nya dan taufiq-Nya.\n<br><br>\n7.     Sesungguhnya Allah ta’ala menghitung semua perbuatan seorang hamba dan membalasnya.\n<br><br>\n8.     Dalam hadits terdapat petunjuk untuk mengubah diri (muhasabah) serta penyesalan atas dosa-dosa"
    },
    {
      "number": 25,
      "title": "Sedekah",
      "arabicTitle": "",
      "imagePath": "assets/images/h25.jpg",
      "audioPath": "assets/audio/hadith25.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith25.png"
      ],
      "htmlDescription": "Daripada Abu Zarr r.a. juga, (beliau meriwayatkan): Bahawa sebahagian sahabat Rasulullah SAW berkata kepada Nabi SAW: <br> \"Wahai Rasulullah! Orang-orang kaya telah mendapat banyak pahala. Mereka sembahyang sebagaimana kami sembahyang, mereka berpuasa sebagaimana kami berpuasa dan mereka bersedekah dengan lebihan harta mereka.\" <br> <br> Baginda bersabda: \"Bukankah Allah telah menjadikan bagi kamu sesuatu yang kamu boleh bersedekah dengannya? <br> Sesungguhnya dengan setiap kali tasbih itu adalah sedekah, setiap kali takbir itu adalah sedekah, setiap kali tahmid itu adalah sedekah, setiap kali tahlil itu adalah sedekah, menyuruh amar ma'aruf itu sedekah, menegah mungkar itu sedekah dan pada kemaluan seseorang kamupun adalah sedekah.\" <br> <br> Mereka bertanya: \"Ya Rasulullah! Adakah apabila salah seorang kami melepaskan syahwatnyapun dia beroleh pahala?\" <br> Baginda bersabda: \"Bagaimana pandangan kamu kalau dia melepaskan syahwatnya pada tempat haram, adakah dia berdosa? Maka demikian jugalah apabila dia melepaskannya pada tempat yang halal, dia beroleh pahala.\"           <br> <br>   (Riwayat Ahmad no. 21483 dan Muslim no. 1006) <br><br><br>\nPelajaran yang terdapat dalam hadits / الفوائد من الحديث :\n<br><br>\n1.     Sikap bijak dalam mnghadapai pelbagai keadaan serta mendatangkan khabar gembira bagi jiwa serta menenangkan perasaan.\n<br><br>\n2.     Para shahabat berlumba-lumba untuk berbuat kebaikan.\n<br><br>\n3.     Luasnya keutamaan Allah ta’ala serta banyaknya pintu-pintu kebaikan yang dibuka bagi hamba-Nya.\n<br><br>\n4.     Semua bentuk zikir sesungguhnya merupakan sedakah yang dikeluarkan seseorang untuk dirinya.\n<br><br>\n5.     Malah menyalurkan syahwat kepada yang halal seperti berjimak dengan isteri juga sedekah\n<br><br>\n6.     Anjuran untuk meminta sesuatu yang dapat memberi manfaat bagi seorang muslim dan yang dapat meningkatkan dirinya ke derajat yang lebih sempurna.\n<br><br>\n7.     Didalam hadits ini terdapat keutamaan orang kaya yang bersyukur dan orang fakir yang bersabar."
    },
    {
      "number": 26,
      "title": "Setiap anggota sebagai Sedekah",
      "arabicTitle": "",
      "imagePath": "assets/images/h26.jpg",
      "audioPath": "assets/audio/hadith26.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith26.png"
      ],
      "htmlDescription": "Daripada Abu Hurairah r.a. beliau berkata: Rasulullah SAW telah bersabda: <br> <br>  \"Setiap anggota badan manusia adalah sedekah baginya pada setiap hari apabila terbit matahari; engkau berlaku adil (iaitu mendamaikan) antara dua orang (iaitu dua orang yang berbalah) adalah sedekah, <br><br> engkau membantu seseorang naik kenderaannya atau mengangkat barang-barangnya ke atas kenderaannya adalah sedekah, perkataan yang baik adalah sedekah, setiap langkah yang engkau hayunkan kaki pergi sembahyang adalah sedekah dan menghilangkan sesuatu bahaya di jalanraya adalah sedekah.\" <br> <br>   (Riwayat al-Bukhari no.2827 dan Muslim no. 1007 dan 1009) <br><br><br>\nPelajaran yang terdapat dalam hadits / الفوائد من الحديث  :\n<br><br>\n1.     Bersyukur kepada Allah ta’ala setiap hari atas nikmat kesihatan anggota badan.\n<br><br>\n2.     Allah telah menjadikan sebagai rasa syukur terhadap nikmat-Nya- setiap anggota badan untuk menolong hamba-hamba Allah ta’ala, bersedekah kepada mereka dengan menggunakannya sesuai kemaslahatannya.\n<br><br>\n3.     Temasuk sedekah adalah : Menahan tangan dan lisan untuk tidak menyakiti orang lain, justeru seharusnya digunakan untuk menunaikan hak-hak setiap muslim.\n<br><br>\n4.     Jasad harus mengeluarkan zakatnya sebagaimana harta ada zakatnya. Zakat badan adalah melakukan perbuatan baik, bersedekah dan pintu-pintunya banyak.\n<br><br>\n5.     Anjuran untuk mendamaikan kedua belah pihak, tolong menolong, mengucapkan kalimat yang baik, berjalan menuju solat dan membuang penghalang dari solat.\n<br><br>\n6.     Anjuran untuk membersihkan sarana-sarana umum.\n<br><br>\n7.     Anjuran untuk melakukan keadilan, karena dengan keadilanlah ditegakkan langit dan bumi."
    },
    {
      "number": 27,
      "title": "Hati Tenang dan Gelisah",
      "arabicTitle": "",
      "imagePath": "assets/images/h27.jpg",
      "audioPath": "assets/audio/hadith27.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith27.png"
      ],
      "htmlDescription": "Daripada Nawas bin Sim’an radhiallahuanhu, dari Rasulullah shollallohu ‘alaihi wa sallam beliau bersabda : <br> \"Kebaikan adalah akhlak yang baik, sedangkan dosa adalah segala hal yang megusik  jiwamu dan engkau tidak suka jika orang lain melihatnya “ <br> <br>  (Riwayat Ahmad 4/228, al-Bukhari dalam al-Adab no.295 dan Muslim no. 2553)  <br> <br>  Dan daripada Wabishah bin Ma’bad radhiallahuanhu dia berkata : Saya mendatangi Rasulullah Shallallahu’alaihi wasallam, lalu baginda bersabda : Apakah engkau datang untuk bertanyakan tentang kebaikan ?, <br> Saya menjawab : Benar!. <br> Baginda bersabda : Mintalah fatwa kepada kamu sendiri. Kebaikan adalah apa-apa yang mententeramkan jiwa dan hati, sedangkan dosa adalah apa-apa yang mengusik jiwa dan meragukan hati, meskipun orang-orang memberi fatwa yang membenarkanmu. <br> <br>   (Riwayat Ahmad no. 18006 dan al-Darimi (2/249).<br><br><br>\nPelajaran yang terdapat dalam hadits / الفوائد من الحديث :\n<br><br>\n\n1.     Tanda perbuatan dosa adalah timbulnya keragu-raguan dalam jiwa dan tidak suka kalau hal itu diketahui orang lain.\n<br><br>\n\n2.     Siapa yang ingin melakukan suatu perbuatan maka hendaklah dia menanyakan hal tersebut pada dirinya .\n\n<br><br>\n3.     Anjuran untuk berakhlak mulia kerana akhlak yang mulia termasuk unsur kebaikan yang sangat besar.\n<br><br>\n4.     Hati seorang mu’min akan tenang dengan perbuatan yang halal dan gusar dengan perbuatan haram.\n\n<br><br>\n5.     Melihat terlebih dahulu ketetapan hukum sebelum mengambil tindakan. Ambillah yang paling dekat dengan ketakwaan dan kewara’an dalam agama.\n\n<br><br>\n6.     Rasulullah shollallohu ‘alaihi wa sallam  ketika menyampaikan sesuatu kepada para shahabatnya selalu mempertimbangkan situasi dan keadaan mereka.\n<br><br>\n7.     Antara sfat orang Mukmin yang Allah telah sebutkan dan surah al-Anfal ayat 2-4 ialah:\n<br><br>\n “Orang yang ketika nama Allah disebut, hati mereka gementar, dan ketika ayat-ayat-Nya dibacakan kepada mereka, iman mereka bertambah dan hanya kepada Tuhanlah mereka bertawakal. (Iaitu) mereka melaksanakan solat dan mengeluarkan infak dariapada sebahagian harta yang Kami berikan kepada mereka. Mereka itulah orang yang benar-benar Mukmin.”\n<br><br>\n8.         Abu Tha’labah al-Khasyani meminta kepada Rasulullah SAW supaya diterangkan apakah yng halal baginya dan haram atasnya? Rasulullah menyatakan, “Kebaikan yang halal itu ialah sesuatu yang tetap oleh diri dan tenang oleh jiwa dalam menghadapainya. Dosa itu ialah sesuatu yang tidak tetap oleh diri dan tiada tenag oleh hati.  (Riwayat Imam Ahmad daripada Abdullah bin al-Ala bin Zayd)\n<br><br>\n9.         Wasilah bin al-Asqa meminta kepada Rasulullah SAW: “Berilah kepadaku satu fatwa tentang sesuatu perkara sehingga aku tiada lagi akan bertanya kepada seseorang sesudah engkau.”\n<br><br>\nMaka Rasulullah pun berkata kepadanya: “Mintalah fatwa daripada diri engkau sendiri.”\n<br><br>\nKataku: “Bagaimanakah yang demikian?”\n<br><br>\nRasulullah menjawab: “Engkau tinggal apa yang meragukan engkau kepada apa yang tiada meragukan engkau. Sekalipun telah berfatwa kepada engkau oelh sekalian orang yang berfatwa.”\n<br><br>\nKataku lagi: “Bagaimanakah yang demikian?”\n<br><br>\nJawab Baginda: “Letakkan tangan engkau di atas hati engkau (bagaimana perasaan engkau?)” Hati akan tenang kepada perkara yang halal dan tiada resah gelisah kepada perkara yang haram.            (Riwayat al-Tabrani)\n<br><br>\nWasiat Nabi Adam a.s\nMenurut riwayat dalam Syarah al-Arbain al-Nawawiyah, Nabi Adam a.s berwasiat kepada anak-anaknya:\n<br><br>\n1.      Jika kamu hendak berbuat sesuatu, tetapi hati kamu gelisah kerananya, maka janganlah kamu teruskan. Sewaktu akan memakan buah khuldi, hatiku telah bergoncang dan gelisah.\n<br><br>\n2.      Jika kamu hendak mengerjakan sesuatu perkara, lihatlah kesudahannya. Kalau aku lihat atau fikirkan tentang kesudahan akibat memakan buah tersebut, tentu aku tidak memakannya.\n<br><br>\n3.      Jika kamu hendak melakukan sesuatu perkara, maka berundinglah dengan orang yang arif. Kalau aku dahulunya berunding dengan malaikat, tentu diberitahu kepada aku supaya aku tidak memakan buah yang terlarang itu."
    },
    {
      "number": 28,
      "title": "Dakwah dan Bida'ah",
      "arabicTitle": "",
      "imagePath": "assets/images/h28.jpg",
      "audioPath": "assets/audio/hadith28.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith28.png"
      ],
      "htmlDescription": "Pelajaran:  <br> <br>  1.     Nasihat Rasulullah shollallohu ‘alaihi wa sallam berbekas dengan dalam dari dalam jiwa para shahabat. Hal tersebut merupakan tauladan bagi para da’i di jalan Allah ta’ala dalam menyampaikan dakwah serta nasihat.  <br> <br> <br>  2.     Taqwa merupakan yang paling penting untuk disampaikan seorang muslim kepada muslim lainnya, kemudian mendengar dan ta’at kepada pemerintah selama tidak terdapat didalamnya maksiat.  <br> <br> <br>  3.     Keharusan untuk berpegang teguh terhadap sunnah Nabi dan sunnah Khulafa al-Rasyidin, kerana didalamnya terdapat kemenangan dan kejayaan, khususnya tatkala banyak terjadi perbezaan dan perpecahan.  <br> <br> <br>  4.     Hadits ini menunjukkan tentang sunnahnya memberikan wasiat saat berpisah karena di dalamnya terdapat kebaikan dan kebahagiaan dunia dan akhirat.  <br> <br> <br>  5.     Larangan untuk melakukan hal yang baru dalam agama (bid’ah) yang tidak memiliki landasan dalam agama.  <br> <br> <br>  6.         Bidaah dari segi syarak adalah sesuatu yang diada-adakan dalam perintah agama yang bersalahan dengan perintah Allah dan dalil syarak sama ada yang khas atau yang umum. Ia adalah dicela dan inilah dimaksudkan dengan, “Setiap bidaah itu sesat”  <br> <br> <br>  7.         Bidaah dari segi bahasa adalah sesuatu yang dicipta dengan tidak ada contoh yang terdahulu. Sebahagian sahabat memandang baik beberapa perkara bidaah contohnya kata-kata Sayidina Umar r.a ketika mengumpul orang ramai untuk bersolat tarawikh pada bulan Ramadhan mengikut seorang imam di masjid “Ini adalah sebaik-baik ibadah.” <br> <br>  Diriwayatkan oleh Ubai bin Kaab beliau telah berkata kepada Sayidina Umar r.a “Ini tidak perbah berlaku. “Umar r.a menjawab, “Sesungguhnya aku mengetahuinya tetapi ia adalah sesuatu yang baik.  <br> <br> <br>  8.         Imam Syafie mengatakan bahawa bidaah terbahagi kepada 2 iaitu biadah yang dipuji dan bidaah yang dikeji. Perkara yang baru (al-Muhdasat) yang menyalahi kitab, sunnah, athar dan ijmak maka ia adalah sesat. Manakala yang tidak menyalahi kitab, sunnah, athar dan ijmak adalah yang baik dan tidak dikeji. (Bidaah Hasanah)"
    },
    {
      "number": 29,
      "title": "Menjaga Lidah",
      "arabicTitle": "",
      "imagePath": "assets/images/h29.jpg",
      "audioPath": "assets/audio/hadith29.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith29.png",
        "assets/images/hadith29_2.png"
      ],
      "htmlDescription": "Daripada Mu'az bin Jabal r.a berkata bahawa beliau bertanya Rasululullah SAW <br> <br>    \"Wahai Rasulullullah, beritahulah kepadaku tentang suatu amal yang dapat memasukkanku ke dalam syurga dan menjauhkanku daripada neraka.   <br> <br>   Nabi SAW menjawab: <br> <br>    \"Engkau bertanya tentang perkara yang besar namun sesungguhnya ia adalah mudah bagi orang yang dimudahkan oleh Allah SWT. Sembahlah Allah dan jangan menyekutukan-Nya dengan sesuatu pun, kerjakanlah solat, keluarkanlah zakat, berpuasalah pada bulan Ramadhan dan kerjakanlah ibadah Haji ke Baitullah.\"  <br> <br>   Kemudian baginda bersabda “Inginkah engkau kuberi petunjuk akan pintu-pintu kebaikan?” <br> <br>    Puasa itu adalah sebagai perisai, sedekah adalah amal yang menghapuskan kesalahan sebagaimana air memadamkan api, dan solatnya seseorang di tengah malam. Kemudian Baginda membaca ayat pada surah Al sajadah, ayat 16-17:  <br> <br>   “Mereka merenggangkan diri daripada tempat tidur (sedikit sangat tidur, kerna mengerjakan solat tahajuj dan amal2 soleh) mereka sentiasa berdoa kepada Tuhan mereka dengan perasaan takut ( akan murka-Nya) serta dengan perasaan ingin memperolehi lagi ( keredhaan-Nya) <br> dan mereka selalu menderma sebahagian daripada apa yang kami beri kepada mereka. Maka tidak ada seorang pun yang mengetahui satu persatu persediaan yang telah dirahsiakan untuk mereka (daripada segala jenis nikmat) yang amat indah dipandang dan mengembirakan, sebagai balasan bagi amal-amal  soleh yang mereka telah kerjakan.”  <br> <br>   Kemudian baginda bersabda <br> <br>     “Mahukah engkau kuberitahu tentang pokok amal, tiang dan puncaknya?” Saya menjawab  “Mahu wahai Rasulullah!” Rasulullah SAW bersabda “Pokok amal adalah Islam, tiangnya adalah solat, dan puncaknya adalah jihad.” <br> Kemudian baginda bersabda: “Mahukah engkau kuberitahu tentang kunci daripada semua perkara itu?” Saya menjawab “Mahu wahai Rasulullah”  <br> <br>   Baginda lalu memegang lidahnya dan bersabda “Jagalah ini!” Saya berkata “Wahai Nabi Allah, adakah kita dihisab atas apa yang kita katakan?” Baginda bersabda: “Semoga ibumu kehilanganmu! (ungkapan hairan). Tidak ada yang menjerumuskan orang ke dalam neraka melainkan hasil daripada ucapannya (yang berbentuk maksiat)?”  <br> <br>   (Hadis riwayat Ahmad no 22016 dan al Tirmizi no 2619) <br><br><br>\nPengajaran hadis:\n\n<br><br>\n(1) Berdasarkan hadis ini, amalan yang boleh memasukkan seseorang hamba ke dalam syurga ialah menunaikan rukun-rukun lslam,<br> iaitu benar-benar beriman kepada Allah tanpa syirik dan beriman kepada Rasulullah SAW, sembahyang, zakat, puasa Ramadhan dan ibadat haji.\n\n<br><br>\n(2) Pintu-pintu kebajikan pula sangat banyak, antaranya yang disebut dalam hadis ini ialah berpuasa kerana ia adalah perisai yang melawan hawa nafsu bagi seorang mukmin. <br>Selain itu ialah sedekah yang ikhlas kerana Allah kerana ia dapat memadamkan dosa seumpama air memadamkan api. Pintu kebajikan seterusnya ialah sembahyang di waktu tengah malam.\n\n<br><br>\n(3) lbadat pada waktu tengah malam sangat afdhal dan amat dituntut ke atas setiap individu muslim. la dapat menguatkan keimanan, keyakinan dan ketaqwaan kepada Allah.<br> la dapat memberikan sinar air muka yang bercahaya bagi orang yang melakukannya. Allah SWT telah memuji orang yang suka beribadat pada waktu tengah malam dalam banyak ayat termasuk ayat yang dipetik dalam hadis ini.\n\n<br><br>\n(4) Tunggak segala perkara ialah lslam, tiangnya ialah sembahyang dan kemuncaknya ialah jihad. Seorang mukmin sejati mesti melaksanakan tuntutan-tuntutan ini dengan baik walau apapun cabaran dan rintangan.\n\n<br><br>\n(5) Kunci segala perkara pula ialah menjaga lidah. Lidah adalah antara anggota badan yang paling banyak terdedah melakukan maksiat. Barangsiapa yang dapat menjaga lidahnya daripada angkara jahat dan maksiat, <br>Baginda Rasulullah SAW menjamin bahawa dia akan dapat masuk syurga. Setiap patah perkataan yang dituturkan oleh lidah akan dipersoalkan Allah SWT. Ramai manusia yang dihumbankan ke neraka akibat celupar lidah."
    },
    {
      "number": 30,
      "title": "Suruhan dan Larangan",
      "arabicTitle": "",
      "imagePath": "assets/images/h30.jpg",
      "audioPath": "assets/audio/hadith30.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith30.png"
      ],
      "htmlDescription": "Daripada Abi Tsa’labah al-Khusyani Jurtsumi bin Nasyirin r.a meriwayatkan daripada Rasulullah SAW, Baginda bersabda :  <br> <br>  Maksudnya: “Sesungguhnya Allah SWT telah menetapkan beberapa kewajipan, maka janganlah engkau meninggalkannya. Dan telah menentukan beberapa hudud (batas), maka janganlah engkau melampauinya. Dan telah mengharamkan beberapa perkara, maka janganlah melanggarinya. Dan Dia telah diam daripada beberapa perkara sebab rahmat bagimu, bukannya kerana lupa, maka janganlah engkau mempersoalkannya.”  <br> <br>  [Riwayat al-Baihaqi no.20217 dalam al-Sunan al-Kubra dan Abu Nu’aim dalam Hilyatul Auliya (9/17)] <br> <br> <br> <br> <br>  Pengajaran hadis:  <br> <br>  (1) Setiap mukmin dituntut supaya mematuhi hukum Allah SWT sama ada berbentuk suruhan fardhu mahupun larangan haram. Hadis tersebut mengingatkan setiap mukmin agar memelihara dengan baik segala amalan fardhu yang Allah SWT fardhukan, jangan sampai dipersiakan atau dihilangkan begitu sahaja. Hukum yang dihadkan Allah janganlah dilampaui daripada ketentuan-Nya. <br> <br> <br>   (2) Demikian pula Allah menentukan beberapa batasan dan beberapa perkara haram, maka setiap mukmin dituntut agar benar-benar menjaga sempadan halal haram ini, jangan sampai dia mencabuli perkara haram apatah lagi kalau sampai menghalalkan perkara haram.  <br> <br> <br>  (3) Di samping itu, Allah SWT mendiamkan beberapa perkara iaitu tidak menyatakan halal haramnya secara jelas, maka janganlah kita menyusahkan diri mencari hukumnya. Allah berbuat demikian bukan kerana lupa, bahkan sebagai rahmat buat umat manusia demi memberi kemudahan bagi manusia.Hukum perkara yang ditinggalkan hukum halal haramnya adalah harus, iaitu boleh dilakukan. <br> <br> <br>   (4) Allah berfirman yang bermaksud: “Wahai orang yang beriman, janganlah kamu menanyakan kepada Nabimu hal-hal yang jika diterangkan kepadamu, nescaya menyusahkanmu.”           (Surah al-Baqarah 2:101)"
    },
    {
      "number": 31,
      "title": "Zuhud",
      "arabicTitle": "",
      "imagePath": "assets/images/h31.jpg",
      "audioPath": "assets/audio/hadith31.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith31.png"
      ],
      "htmlDescription": "Daripada Abi al-Abbas Sahl bin Sa’ad al-Sa’idi r.a berkata, bahawa seseorang datang kepada Nabi SAW seraya berkata:  <br> <br>  Maksudnya: “Wahai Rasulullah, tunjukkanlah saya suatu pekerjaan yang jika dikerjakan nescaya saya dicintai Allah dan dicintai umat manusia.’ Rasulullah SAW bersabda: ‘Zuhudlah engkau akan dunia, nescaya Allah akan menyintaimu, dan zuhudlah engkau akan apa yang ada pada manusia, nescaya mereka mencintaimu.” <br> <br>   (Riwayat Ibn Majah no. 4102 dan al-Baghawi dalam Syarhus Sunnah)  <br> <br> <br> <br> <br>  Pengajaran Hadis:  <br> <br>  (1) Hadis ini menerangkan suatu sifat penting yang harus ada pada diri setiap mukmin iaitu sifat zuhud.  <br> <br>   (2) Dari segi bahasa zuhud/zahid ialah berpaling daripada sesuatu atau tidak mengkehendaki kepada sesuatu kerana tiada mutu atau nilainya. <br> <br>   (3) Dari segi syarak zuhud/zahid ialah mengambil sekadar yang perlu daripada sesuatu yang diyakini halalnya.  <br> <br>  (4) Warak pula bererti tidak mahu mengambil atau menggunakan sesuatu yang syubhah (yang kesamaran hukumnya) kerana ditakuti jatuh kepada yang haram. <br> <br>   (5) Zuhud terhadap dunia mempunyai banyak pengertian di kalangan ulama tasauf antaranya ialah membenci, berpaling, meninggalkan dan menjauhkan diri dari kemewahan dunia serta mengosongkan hati dari mengingati perkara dunia.  <br> <br>  (6) Zuhud terhadap apa yang dimiliki manusia, bererti menjauhkan diri dari merasa irihati terhadap apa yang dimiliki oleh manusia serta mengosongkan hati dari mengingati harta milik orang. lni bukan bererti membenci sehingga suka agar kesenangan orang lain hilang kerana itu hasad dengki yang amat dilarang.  <br> <br>  (7) Zuhud sebenar bukan bererti meninggalkan dunia atau langsung tidak berharta. Zuhud sejati ialah tidak menjadikan dunia dan kemewahan hidup sebagai matlamat hidup, walaupun kekayaannya memenuhi dunia seumpama yang terjadi pada jutawan zaman Rasulullah SAW seperti Abdul Rahman ibn 'Auf, kerana matlamat hidup seorang mukmin ialah Allah dan keredhaanNya, bukan benda-benda selainNya.  <br> <br>  (8) Rasulullah SAW bersabda yang bermaksud: “Orang yang zuhud dariapda segala kesenangan dunia menjadikan hatinya lapang di dunia dan di akhirat. Sedangkan orang yang mencintai dunia hatinya menjadi resah di dunia dan di akhirat.” <br> <br>  (9) Rasulullah SAW bersabda yang bermaksud: “Sebaik-baik negeri adalah dunia bagi mereka yang berbekal daripadanya untuk akhiratnya hingga reda Tuhannya, dan sejahat-jahat negeri bagi mereka yang menghalangi daripada akhiratnya dan memundurkan dia daripada keredhaan Tuhannya. Dan apabila seorang hamba berkata: ‘Semoga Allah burukkan dunia’, maka berkatalah dunia kepadanya: ‘Allah burukkan dia kerana dialah yang derhakakan kami kepada Tuhannya.”  <br> <br>  (10) Rasulullah SAW bersabda yang bermaksud: “Kemuliaan seseorang ialah berdiri pada waktu malam (untuk solat) dan kehormatanya ialah terkaya (tidak bergantung) daripada manusia.”  <br> <br>   (11) Saidina Ali k.w.h berkata: “Dunia ini adalah negeri benar bagi orang yang benar padanya, negeri balasan bagi orang yang memahaminya dan negeri kekayaan bagi orang yang menyediakan bekalan-bekalan dariapadanya.” <br> <br>  (Riwayat Abdul Jabar bin Wahab)"
    },
    {
      "number": 32,
      "title": "Larangan membuat keburukan kepada orang lain",
      "arabicTitle": "",
      "imagePath": "assets/images/h32.jpg",
      "audioPath": "assets/audio/hadith32.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith32.png"
      ],
      "htmlDescription": "Daripada Abi Sa’id bin Malik bin Sinan al-Khudri r.a berkata, bahawa Rasulullah SAW bersabda:  <br> <br>  Maksudnya: “Tidak boleh menimpakan bahaya (kepada orang yang tidak bersalah) dan menimpakan balasan yang membahayakan (melanggar syariat).”  <br> <br>  Ada pula yang menggunakan:  <br> <br>  Maksudnya: “Tidak boleh menimpakan bahaya pada diri sendiri dan kepada orang lain.”  <br> <br>  (Riwayat Ahmad no.2867, Malik no.31, Ibn Majah no.2340,2341 dan al-Daruqutni no.(3/77))  <br> <br> <br>  Pengajaran hadis. <br> <br>   (1) Janganlah menzalimi diri sendiri dan orang lain sebagaimana hadis riwayat Abu Dzar: “Wahai hamba-Ku, sesungguhnya Aku telah mengharamkan diriku berbuat zalim dan menjadikan haram juga antara kamu, maka janganlah kamu saling menzalimi.”  <br> <br>  (2) Sabda Nabi SAW yang bermaksud : “Tunaikanlah amanat kepada orang yang memberikan amanat kepadamu, dan janganlah kamu berkhianat kepada orang yang berkhianat.  <br> <br>  (3) Janganlah menzalimi diri sendiri sebagamana hadis riwayat Anas: “Pada suatu hari Rasulullah SAW melihat seorang lelaki sedang berjalan kaki. Ada orang memberitahu bahawa lelaki itu bernazar untuk berjalan kaki pergi menunaikan ibadah haji dan sekarang dia hendak melaksanakannya. <br> Kemudian Rasulullah SAW bersabda menerangkan, ‘Allah tidak menghendaki perjalanannya. Sebab itu hendaklah dia berkenderaan.”  <br> <br>  (4) Rasulullah SAW bersabda yang bermaksud: “Agama itu mudah.”  <br> <br>  (5) Janganlah berbuat keburukan kepada orang lain ataupun berbuat sesuatu kebaikan untuk diri sendiri tetapi memudaratkan orang lain seperti membakar sampah di laman sendiri tetapi asapnya mengganggu jiran yang lain."
    },
    {
      "number": 33,
      "title": "Bukti dan Sumpah",
      "arabicTitle": "",
      "imagePath": "assets/images/h33.jpg",
      "audioPath": "assets/audio/hadith33.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith33.png"
      ],
      "htmlDescription": "Daripada Ibn Abbas r.a meriwayatkan, bahawa sesungguhnya Rasulullah SAW bersabda:  <br> <br>  Maksudnya: “Jika semua orang dipenuhi akan tuntutannya, nescaya akan ada orang menuntut harta benda dan darah suatu kaum. Akan tetapi hendaklah ada bukti bagi orang yang menuduh dan ada sumpah bagi yang mengingkari.” <br> <br>   (Riwayat al-Baihaqi no 20990, hasan sebahagian lafaznya diriwayatkan oleh al-Bukhari no. 4552 dan Muslim no. 1711)  <br> <br> <br> Pengajaran hadis:  <br> <br>  1.     Seorang hakim harus meminta dari kedua orang yang bersengketa sesuatu yang dapat menguatkan pengakuan mereka seperti saksi yang cukup syarat-syaratnya. <br> <br>   2.     Seorang hakim tidak boleh memutuskan sebuah perkara dengan menghalalkan yang haram dan mengharamkan yang halal. <br> <br>   3.     Pada dasarnya seseorang bebas dari tuduhan hingga terbukti perbuatan jahatnya.  <br> <br>  4.     Seorang hakim harus berusaha keras untuk mengetahui permasalahan sebenarnya dan menjelaskan hukumnya berdasarkan apa yang tampak baginya. <br> <br>   5.     Bersumpah hanya diperbolehkan atas nama Allah. <br> <br>   6.     Hadis pada riwayat al-Bukhari dan Muslim disebutkan bahawa Ibn Abu Mulaikah mengatakan: “Ibn Abbas menulis bahawa sesungguhnya Nabi SAW telah menetapkan sumpah untuk orang yang menyangkal.  <br> <br>  7.     Nabi SAW bersabda yang bermaksud: “Sekiranya manusia dikabulkan apa sahaja yang menjadi pengakuannya, nescaya orang akan mudah menuntut darah dan harta orang lain. Akan tetapi, sumpah itu untuk orang yang menyangkal dakwaan.”"
    },
    {
      "number": 34,
      "title": "Amar Ma'ruf nahi mungkar",
      "arabicTitle": "",
      "imagePath": "assets/images/h34.jpg",
      "audioPath": "assets/audio/hadith34.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith34.png"
      ],
      "htmlDescription": "Daripada Abi Sa’id al-Khudri r.a berkata bahawa beliau mendengar Rasulullah SAW bersabda:  <br> <br>  Maksudnya: “Sesiapa antara kamu melihat kemungkaran hendaklah dia mengubah dengan tangannya; jika tidak sanggup maka dengan lisannya; dan jika tidak sanggup juga dengan hatinya. Itu adalah selemah-lemah iman.”  <br> <br>  (Riwayat Ahmad no. 11478, Muslim no. 49, Abu Daud no. 1140 dan al-Tirmizi no. 2172)   <br> <br> <br>  Pengajaran hadis: <br> <br>  1.     Menentang pelaku kebatilan dan menolak kemunkaran adalah kewajiban yang dituntut dalam ajaran Islam atas setiap muslim sesuai kemampuan dan kekuatannya. <br> <br>   2.     Redha terhadap kemaksiatan termasuk diantara dosa-dosa besar. <br> <br>  3.     Sabar menanggung kesulitan dan amar ma’ruf nahi munkar. <br> <br>  4.     Amal merupakan buah dari iman, maka menyingkirkan kemungkaran juga merupakan buahnya keimanan.  <br> <br>  5.     Mengingkari dengan hati diwajibkan kepada setiap muslim, sedangkan pengingkaran dengan tangan dan lisan berdasarkan kemampuannya.  <br> <br>  6.     “Mengubah dengan tangan” itu ialah jika ada kekuasaan, bukan mengubah dengan kekerasan yang boleh membawa kepada perkelahian, kekacauan, peperangan dan pertumpahan darah.  <br> <br>  7.     Mengubah dengan lisan ialah dengan kata-kata, dakwah dan tunjuk ajar. Rasulullah SAW bersabda yang bermaksud: “Jihad yang utama ialah perkataan yang benar di sisi pemerintah yang zalim.” (Riawayat Ahmad no. 11159 daripada Abu Said r.a) <br> <br>   8.     Mengubah dengan hati ialah dengan cara tidak bersetuju sepenuhnya kemungkaran yang berlaku dan menentang serta membenci kemungkaran tersebut dengan hati.  <br> <br>   9.     Ibn Mas’ud berkata: “Binasalah orang yang tidak mengetahui dengan hatinya akan yang hak dan yang mungkar.”"
    },
    {
      "number": 35,
      "title": "Dengki memakan kebaikan",
      "arabicTitle": "",
      "imagePath": "assets/images/h35.jpg",
      "audioPath": "assets/audio/hadith35.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith35.png"
      ],
      "htmlDescription": "Daripada Abi Hurairah r.a berkata bahawa Rasulullah SAW bersabda: <br> <br>   Maksudnya: “Janganlah saling mendengki, saling menipu, saling membenci, saling membelakangi dan janganlah sebahagian kamu membeli barang yang telah dibeli oleh orang lain. <br> <br> Jadilah kamu hamba-hamba Allah yang bersaudara. Seorang Muslim adalah saudara bagi muslim yang lain. Dia tidak patut menzalimi, membohongi, dan merendahkannya. <br> <br>  Takwa itu di sini (beliau menunjukkan dadanya tiga kali). Cukuplah seseorang  dikatakan buruk jika sampai menghina saudaranya sesama setiap Muslim adalah haram bagi Muslim yang lain.” <br> <br> (Riwayat Ahmad no. 7713 dan Muslim no. 2563)  <br> <br>  <br>  Pengajaran hadis:  <br> <br>  1.     Larangan untuk saling dengki. Terdapat sebuah hadis lain menyebut: “Jauhilah olehmu sekalian sifat dengki, kerana dengki itu memakan segala kebaikan seperti api memakan kayu.”   <br> <br>  2.     Larangan untuk berbuat keji dan menipu dalam urusan jual beli. <br> <br>   3.     Larangan membeli barang yang telah dibeli oleh orang lain. Rasulullah SAW bersabda yang bermaksud: “Tidak menjual seorang lelaki atas penjualan saudaranya dan tidak meminang atas peminangan saudaranya kecuali jika ia izin kepadanya.” (Riwayat Ibn Umar) <br> <br>    4.     Larangan menghina sesama Muslim kerana sifat angkuh dan sombong. Sifat ini akan melenyapkan perasaan kasih sayang sesama Islam. Rasulullah SAW bersabda yang bermaksud: “Kamu tidak akan masuk syurga sehingga kamu beriman. Dan tidak dikatakan kamu beriman sehingga kamu berkasih-kasihan. Mahukan aku tunjukkan kepada kamu satu perkara yang apabila kamu perbuat akan dia nescaya kamu berkasih-kasih? Iaitulah sebarkan salam di antara kamu.” (Riwayat Muslim no. 54) <br> <br>   5.     Diharamkan untuk memutuskan hubungan terhadap muslim. Sebaliknya harus dijaga persaudaraan dan hak-haknya karena Allah Ta’ala. <br> <br>    6.     Seorang ulama tasawuf, al-Razi (Yahya bin Mu’ adh) berkata: “Hendaklah engkau pelihara tiga perkara yang menjadi habuan orang Mukmin, iaitu:  <br> <br>  Pertama : Jika engkau tidak dapat memberi manfaat kepadanya, maka janganlah engkau menyusahkan dia. <br> <br> Kedua: Jika engkau tidak mahu menyukakan dia, maka janganlah engkau mendukakan dia. <br> <br>  Ketiga: Jika engkau tidak mahu memuji dia maka janganlah engkau mencela dia.” <br>  <br>   7.     Islam bukan hanya aqidah dan ibadah saja, tetapi juga didalamnya terdapat urusan akhlak dan muamalah. <br> <br>   8.     Hati merupakan sumber rasa takut kepada Allah Ta’ala. <br> <br>   9.     Taqwa merupakan barometer keutamaan dan timbangan seseorang.  <br><br>  10.     Islam memerangi semua akhlak tercela karena hal tersebut berpengaruh negatif dalam masyarakat Islam."
    },
    {
      "number": 36,
      "title": "Menutup aib dan Mencari ilmu",
      "arabicTitle": "",
      "imagePath": "assets/images/h36.jpg",
      "audioPath": "assets/audio/hadith36.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith36.png"
      ],
      "htmlDescription": "Daripada Abi Hurairah r.a meriwayatkan daripada Nabi SAW, Baginda bersabda: <br> <br>   Maksudnya: “Sesiapa melepaskan salah satu kesusahan dunia daripada seorang Mukmin, maka Allah akan melepaskan salah satu kesusahan pada hari kiamat daripadanya. <br> Sesiapa memudahkan orang yang tengah dilanda kesulitan maka Allah akan memudahkannya di dunia dan di akhirat. <br> Sesiapa menutup aib seorang Muslim maka Allah akan menutup aibnya di dunia dan di akhirat. Allah menolong hamba-Nya selama hamba itu menolong saudaranya. <br>  Sesiapa menempuh suatu jalan dalam rangka mencari ilmu, maka Allah akan memudahkan baginya jalan menuju syurga. <br> <br>  Tidaklah suatu kaum berkumpul di salah suatu rumah Allah dengan membaca kitab Allah dan mempelajarinya bersama-sama, kecuali bahawa ketenteraman akan turun kepada mereka, malaikat menaungi mereka di hadapan makhluk yang di sisi-Nya, <br> dan sesiapa yang lambat (kurang) amalannya, maka tidak akan dipercepat mengangkat darjatnya.”  <br> <br>  (Riwayat Muslim no.2699, 2580 dan al-Tirmizi no. 2940)<br><br><br>\nPengajaran hadis:\n<br><br>\n1.     Siapa yang membantu seorang muslim dalam menyelesaikan kesulitannya, maka akan dia dapatkan pada hari kiamat sebagai tabungannya yang akan memudahkan kesulitannya di hari yang sangat sulit tersebut.\n<br><br>\n2.     Kita hendaklah menutup aib dab malu seorang Muslim dan sebagai ganjaran Allah akan menutup aib kita di akhirat.\n<br><br>\n3.     Sesungguhnya pembalasan disisi Allah ta’ala sesuai dengan jenis perbuatannya.\n<br><br>\n4.     Berbuat baik kepada makhluk merupakan cara untuk mendapatkan kecintaan Allah Ta’ala.\n<br><br>\n5.     Membenarkan niat dalam rangka mencari ilmu dan ikhlas di dalamnya agar tidak menggugurkan pahala sehingga amalnya dan kesungguhannya sia-sia.\n<br><br>\n6.     Memohon pertolongan kepada Allah ta’ala dan kemudahan dari-Nya, kerana ketaatan tidak akan terlaksana kecuali kerana kemudahan dan kasih sayang-Nya.\n<br><br>\n7.     Selalu membaca Al Quran, memahaminya dan mengamalkannya.\n<br><br>\n\n8.     Keutamaan duduk di rumah Allah untuk mengkaji ilmu."
    },
    {
      "number": 37,
      "title": "Catatan kebaikan dan keburukan",
      "arabicTitle": "",
      "imagePath": "assets/images/h37.jpg",
      "audioPath": "assets/audio/hadith37.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith37.png",
        "assets/images/hadith37_2.png"
      ],
      "htmlDescription": "Daripada Ibn Abbas r.a meriwayatkan daripada Rasulullah SAW wahyu daripada Allah SWT yang berfirman: <br> <br>  Maksudnya: “Sesungguhnya Allah menetapkan kebaikan-kebaikan dan keburukan-keburukan kemudian menerangkannya: Sesiapa berhasrat mengerjakan namun tidak jadi mengerjakannya, Allah mencatat di sisi-Nya satu kebaikan yang sempurna. Jika dia berhasrat mengerjakan kebaikan lalu benar-benar mengerjakannya, Allah mencatat nilai kebaikan itu sepuluh kali hingga tujuh ratus kali ganda, bahkan berlipat ganda lagi. <br><br>Dan sesiapa berhasrat mengerjakan keburukan namun tidak jadi mengerjakannya, Allah mencatat di sisi-Nya satu kebaikan yang sempurna, dan jika dia berhasrat mengerjakan keburukan lalu benar-benar mengerjakannya, Allah hanya mencatat satu keburukan untuknya.” <br> <br>  (Riwayat Ahmad no. 2828, al-Bukhari no. 6126 dan Muslim no. 131)<br><br><br>Pengajaran hadis:\n<br><br>\n1.     Kasih sayang Allah terhadap hamba-Nya yang beriman sangat luas dan ampunannya menyeluruh sedang pemberian-Nya tidak terbatas.\n<br><br>\n2.     Sesungguhnya apa yang tidak kuasa oleh manusia, dia tidak diperhitungkan dan dipaksa menunaikannya.\n<br><br>\n3.     Allah tidak menghitung keinginan hati dan kehendak perbuatan manusia kecuali jika kemudian dibuktikan dengan amal perbuatan dan praktik.\n<br><br>\n4.     Seorang muslim hendaklah meniatkan perbuatan baik selalu dan membuktikannya, diharapkan dengan begitu akan ditulis pahalanya dan ganjarannya dan dirinya telah siap untuk melaksanakannya jika sebabnya telah tersedia.\n<br><br>\n5.     Semakin besar tingkat keikhlasan semakin berlipat-lipat pahala dan ganjaran.\n<br><br>\n6.     Firman Allah SWT: Maksudnya: Barang siapa melakukan amal yang baik, maka baginya pahala sepuluh kali lipat amalnya. (Surah al-An’am 6 :160)\n<br><br>\n7.     Firman Allah SWT: Maksudnya: Perumpamaan nafkah yang dikeluarkan oleh orang yang menafkahkan hartanya pada jalan Allah adalah serupa dengan sebutir benih yang menumbuhkan tujuh tangkai. Setiap tangkai seratus biji. Allah melipatgandakan ganjaran bagi siapa yang Dia kehendaki. Dan Allah Maha Luas kurnia-Nya lagi Maha Mengetahui. (Surah al-Baqarah 2 : 261)\n<br><br>\n8.     Rasulullah SAW bersabda yang bermaksud: “Seorang lelaki datang dengan membawa unta terikat lalu berkata,’Ya Rasulullah, unta ini saya berikan untuk keperluan fi sabilillah.’ Rasulullah menjawab, ‘Kamu akan mendapat seratus ekor unta pada hari kiamat kelak.’” (Riwayat Muslim daripada Ibn Mas’ud r.a)\n<br><br>\n9.     Ibn Khalaf yang dikenali dengan nama Ibn Bathal, pengarang kitab al-Ifshah dalam salah satu kenyataan mengatakan: “Sesungguhnya tatkala Allah mengurangi umur umat Muhammad SAW, Allah mengganti singkatnya umur itu dengan melipat-gandakan pahala amalnya.”\n<br><br>\n10.     Firman Allah SWT: Maksudnya: Dan sesiapa yang melakukan perbuatan yang jahat maka dia tidak diberi pembalasan melainkan seimbang dengan kejahatannya, sedang mereka sedikit pun tidak dianiaya (dirugikan). (Surah al-An’am 6 : 160)\n<br><br>\n11.     Abu Darda’ berkata: “Sesiapa yang ketika hendak tidur berniat untuk melakukan qiamul-ail, akan tetapi ia tidak terbangun hingga subuh, maka baginya pahala daripada apa yang telah diniatkan.”"
    },
    {
      "number": 38,
      "title": "Wali Allah",
      "arabicTitle": "",
      "imagePath": "assets/images/h38.jpg",
      "audioPath": "assets/audio/hadith38.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith38.png"
      ],
      "htmlDescription": "Daripada Abu Hurairah r.a berkata: Rasulullah SAW bersabda, bahawa Allah SWT berfirman: <br> <br>   Maksudnya: “Sesiapa memusuhi wali-Ku, maka Kuizinkan dia diperangi. Tidaklah hamba-Ku mendekatkan diri kepada-Ku dengan sesuatu amal yang lebih Kusukai daripada jika dia mengerjakan amal yang Kuwajibkan kepadanya. Hamba-Ku sentiasa mendekatkan diri kepada-Ku dengan amalan-amalan sunah sehingga Aku mencintainya. <br> Jika Aku mencintainya, jadilah Aku sebagai telinganya untuk mendengar dan sebagai matanya untuk melihat dan sebagai kakinya untuk berjalan dan jika dia meminta kepada-Ku pasti Kuberi dan jika dia meminta perlindungan kepada-Ku pasti Kulindungi.”  <br> <br>  (Riwayat al-Bukhari no. 6137 dan al-Baghawi jilid 7 halaman 204 dalam Syarhus Sunnah)<br><br><br>Pengajaran Hadis:\n<br><br>\n1.     Besarnya kedudukan seorang wali, karena dirinya diarahkan dan dibela oleh Allah ta’ala. Wali Allah ialah orang yang melakukan ketaatan kepada Allah SWT. Allah SWT berfirman : <br>Maksudnya: Ingatlah, sesungguhnya wali-wali Allah itu, tidak ada kekhuatiranterhadap mereka dan tidak pula mereka bersedih. Iaitu orang yang beriman dan mereka selalu bertakwa. (Surah Yunus 10: 62-63)\n<br><br>\n2.     Perbuatan-perbuatan fardhu merupakan perbuatan-perbuatan yang dicintai Allah ta’ala .\n<br><br>\n3.     Siapa yang istiqamah melaksanakan sunnah dan menghindar dari perbuatan maksiat maka dia akan meraih kecintaan Allah ta’ala.\n<br><br>\n4.     Jika Allah ta’ala telah mencintai seseorang maka dia akan mengabulkan doanya."
    },
    {
      "number": 39,
      "title": "Sengaja dan Tidak Sengaja",
      "arabicTitle": "",
      "imagePath": "assets/images/h39.jpg",
      "audioPath": "assets/audio/hadith39.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith39.png"
      ],
      "htmlDescription": "Daripada Ibn Abbas r.a berkata, bahawa sesungguhnya Rasulullah SAW bersabda:  <br><br>  Maksudnya: “Sesungguhnya Allah telah memaafkan (keranaku) daripada umatku amal-amal yang khilaf dan lupa dan dipaksakan atas mereka.” <br><br>   (Riwayat Ibn Majah no. 2034, al-Baihaqi (10/60), al-Tabarani no. 765, al-Daraqutni (VII/170) dan al-Hakim (11/198)) <br><br><br><br> Pengajaran Hadis: <br><br>  1.     Allah ta’ala mengutamakan umat ini dengan menghilangkan berbagai kesulitan dan memaafkan dosa kesalahan dan lupa. <br><br>  2.     Sesungguhnya Allah ta’ala tidak menghukum seseorang kecuali jika dia sengaja berbuat maksiat dan hatinya telah berniat untuk melakukan penyimpangan dan meninggalkan kewajiban dengan sukarela . <br><br>  3.     Manfaat adanya kewajiban adalah untuk mengetahui siapa yang ta’at dan siapa yang membangkang. <br><br>  4.     Ada beberapa perkara yang tidak begitu saja dimaafkan. Misalnya seseorang melihat najis di bajunya akan tetapi dia mengabaikan untuk menghilangkannya segera, kemudian dia shalat dengannya karena lupa, maka wajib baginya mengqhada shalat tersebut. Contoh seperti itu banyak terdapat dalam kitab-kitab fiqh.  <br><br>  5.     Ibn Hajar al-Haitami berkata: “Hadis ini mempunyai manfaat yang menyeluruh kerana terdapat tiga perkara yang dibicarakan hadis ini sering dijumpai dalam semua masalah feqah.  <br><br>  6.     Semua perbuatan tidak terlepas daripada dua keadaan: sengaja dan tidak sengaja merangkumi kekeliruan, lupa dan dipaksa. <br><br>   7.    Dalam sebuah ayat yang bermaksud: Jika kamu melahirkan apa yang ada di hati kamu atau kamu sembunyikan, maka Allah akan mengadili kamu dengan apa yang kamu lakukan itu. (Surah al-Baqarah 2: 284)  <br><br>  8.     Ayat ini menyebabkan para sahabat berasa tertekan. Oleh kerana itu, Abu Bakar, Umar, Abdurrahman bin Auf dan Mu’adz bin Jabal dengan beberapa orang mendatangi Rasulullah SAW.  <br><br>  9.     Mereka berkata: “Kami dibebankan dengan amal yang tak sanggup kami memikulnya. Sesungguhnya seseorang antara kami dalam hatinya ada bisikan yang tidak disenanginya, sekalipun bisikan itu menjanjikan dunia.”  <br><br> 10.     Nabi SAW lalu menjawab: “Boleh jadi kamu mengucapkan kalimah seperti yang diucapkan Bani Israil, iaitu kami mahu mendengar tetapi kami akan menentangnya. Kerana itu katakanlah: ‘Kami mahu mendengar dan mahu mentaati.” <br><br>  11.     Perkara itu membuatka mereka berasa tertekan dan mendiamkan diri. Lalu Allah memberikan kelonggaran dan rahmat-Nya dengan berfirman: <br><br> Maksudnya: Allah tidak membebani seseorang kecuali sesuai dengan kemampuannya. Dia akan mendapatkan pahala atas usahanya dan mendapatkan seksa atas kesalahannya, (lalu dia berdoa): ‘Ya Tuhan kami, janganlah Engkau hukum kami jika kami lupa atau bersalah.’ <br>  (Surah al-Baqarah 2: 286)  <br><br>  12.     Imam Baihaqi berkata bahawa Imam Syafi’i menyatakan: <br> “Allah berfirman: ‘Kecuali orang yang dipaksa, sedang hatinya berasa tenteram dengan imannya (maka orang semacam ini tidak berdosa).”’ <br><br>   13.     Diampuni dosa bukan bererti terbebas daripada tanggungjawab lain. Misalnya: <br> Seorang yang tertembak kawan ketika berburu atau tertembak orang Islam ketika berperang dengan orang kafir maka ia tidak dibebani dosa, tetapi diwajibkan membayar kafarah. <br>    Seorang yang tidak melaksanakan solat kerana tertidur atau lupa, maka ia tidak berdosa, namun ia dituntut menqada solatnya ketika ia ingat atau terjaga daripada tidur.  <br>   Orang yang dipaksa untuk mengucapkan perkataan yang menjadikannya murtad tetapi hatinya penuh keimanan. Tetapi jika dia tetap teguh serta tidak megucapkan perkataan tersebut hingga menyebabkan ia diseksa atau dibunuh, itu lebih mulia baginya dan jika terbunuh ia mati syahid."
    },
    {
      "number": 40,
      "title": "Ambil sekadar perlu",
      "arabicTitle": "",
      "imagePath": "assets/images/h40.jpg",
      "audioPath": "assets/audio/hadith40.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith40.png"
      ],
      "htmlDescription": "Daripada Ibn Umar r.a beliau berkata, bahawa Rasulullah memegang belakang beliau lalu bersabda:\n<br><br>\nMaksudnya: “’Janganlah engkau di dunia ini seakan-akan orang asing atau pengembara.’Lalu Ibn Umar r.a berkata: <br>‘Jika engkau telah berada di waktu petang, maka janganlah dinantikan waktu pagi. Jika engkau berada di waktu pagi, maka janganlah dinantikan waktu petang. Pergunakanlah waktu sihatmu sebelum waktu sakit dan waktu hidup sebelum mati.’”\n<br><br>\n(Riwayat al-Bukhari no. 6416 dan al-Tirmizi no. 2333)\n<br><br><br>\nPengajaran hadis:\n\n<br><br>\n1. Imam Abul Hasan ‘Ali bin Khalaf dalam syarah Bukhari berkata bahawa Abu Zinad berkata:<br>\n“Hadis ini bermakna menganjurkan agar sedikit bergaul dan sedikit berkumpul dengan orang-orang awam serta bersikap zuhud kepada dunia.”\nAbu Hasan berkata:\n<br><br>\n“Maksudnya dari hadis ini ialah orang asing biasanya sedikit berkumpul dengan orang lain sehingga dia terasing daripada mereka, kerana hampir-hampir dia hanya berkumpul dan bergaul dengan orang-orang ini sahaja. Dia menjadi orang yang berasa lemah dan takut..”\n<br><br>\n“Begitu pula seorang pengembara, dia hanya mahu melakukan perjalanan mengikut kekuatannya. Dia hanya membawa beban yang ringan agar dia tidak dibebani untuk menempuh perjalanannya.<br> Dia hanya membawa bekal dan kenderaan yang diperlukan untuk mencapai tujuannya.\n<br><br>\nHal ini menunjukkan bahawa sikap zuhud terhadap dunia dimaksudkan untuk dapat sampai kepada tujuan dan mencegah kegagalan, seperti halnya seorang pengembara yang hanya membawa bekal sekadarnya agar sampai ke tempat yang dituju.\n<br><br>\nBegitu pula halnya dengan seorang Mukmin dalam kehidupan di dunia ini hanyalah memerlukan sekadar bekal untuk mencapai tujuan hidupnya.\n<br><br>\n2. Ada ketikanya Rasulullah SAW menyentuh anggota badan orang yang dinasihat ketika menyampaikan amanat dan ilmu. Kaedah ini harus digunakan oleh para pendidik.\n<br><br>\nIbn Mas’ud berkata, “Rasulullah SAW telah mengajarkan kepadaku cara bertasyahud, sambil memegang tapak tanganku.”\n<br><br>\n3. Dunia ini sementara da akhirat itu kekal abadi. Firman Allah:\nMaksudnya: Tiap-tiap yang bernyawa akan merasai mati.\n(Surah Ali ‘Imran 3: 185)\n<br><br>\n4. Dunia hanyalah jambatan yang akan menghubungkan kita ke akhirat. Allah berfirman:\n<br><br>\nMaksudnya: Kehidupan dunia ini tidak lain hanyalah kesenangan yang menipu daya.\n(Surah Ali ‘Imran 3: 185)\n<br><br>\n5. Gunakan kesempatan hidup untuk berbakti kepada Allah SWT. Rasulullah SAW bersabda:\n<br><br>\n“Manfaatkan lima perkara sebelum datang lima perkara yang lain: Masa muda sebelum masa tua, sihat sebelum sakit, kaya sebelum miskin, masa lapang sebelum sibuk dan masa hidup sebelum mati.”\n(Riwayat al-Hakim daripada Ibn Umar r.a)\n<br><br>\n6. Hendaklah segera melakukan kebaikan, banyak melakukan ketaatan dan jangan menunda pekerjaan.\n<br><br>\n7. Bezuhudlah terhadap dunia, bukan meninggalkan usaha tetapi berwaspada terhadap dunia agar tidak melupakan akhirat.\n<br><br>\n8. Bersungguh-sungguh melakukan amal soleh dan sentiasa takut dengan azab daripada Allah SWT.\n<br><br>\n9. Berwaspada terhadap orang yang berperilaku buruk."
    },
    {
      "number": 41,
      "title": "Melawan Hawa Nafsu",
      "arabicTitle": "",
      "imagePath": "assets/images/h41.jpg",
      "audioPath": "assets/audio/hadith41.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith41.png"
      ],
      "htmlDescription": "Daripada Abi Muhammad Abdillah bin ‘Amr bin al-‘Ash r.a, berkata, bahawa Rasulullah SAW bersabda:\n<br><br>\nMaksudnya: “Tidak beriman seseorang kamu sehingga hawa nafsunya mengikuti apa yang telah aku bawa (sampaikan).”\n<br><br>\n(Riwayat al-Hakim (4/164), al-Khatib (4/368) dan Ibn Abi Asim no. 15)\n\n<br><br><br>\nPengajaran hadis :\nHadis ini selari dengan firman Allah:\n<br><br>\nMaksudnya: Demi Tuhanmu, mereka tidak dikatakan beriman sebelum mereka berhukum kepada kamu mengenai perselisihan sesama mereka, mereka tidak berasa berat hati atas keputusan kamu serta menerima dengan pasrah sepenuhnya.\n<br><br>\n(Surah al-Nisa’ 4: 65)\n<br><br>\nAntara sebab turunnya ayat ini adalah kerana telah terjadi sedikit perselisihan antara al-Zubair dengan seorang sahabat daripada golongan Ansar dalam masalah air.\n<br><br>\nKedua-duanya telah mengadukannnya kepada Rasulullah SAW untuk mendapatkan penyelesaian. Lalu Nabi SAW bersabda:\n<br><br>\n“Wahai Zubair, alirkanlah dan tuangkanlah air kepada tetanggamu.”\n<br><br>\nNabi SAW menganjurkan kepada al-Zubair untuk bersikap memudahkan dan bertoransi. Akan tetapi, sahabat Ansar itu berkata: “Adakah kerana dia anak saudaramu?” Maka merahlah wajah Rasulullah SAW kemudian sabda Baginda yang bermaksud:\n<br><br>\n“Wahai Zubair, tutuplah alirannya sampai airnya naik ke atas pagar kemudian biarkanlah sehingga tumpah.”\n<br><br>\nRasulullah SAW melakukan perkara itu untuk memberi isyarat kepada Zubair bahawa apa yang diputuskan beliau mengandungi maslahat bagi golongan Ansar.<br> Tatkala orang Ansar memahami sabda Nabi SAW itu, maka Zubair menyedari apa yang menjadi hak dan kewajipannya. Kerana kejadian itulah ayat ini diturunkan.\n<br><br>\n1.         Allah SWT menjadikan seorang Muslim sebagai manusia yang sempurna.\n<br><br>\n2.         Hawa nafsu manusia lebih cenderung kepada keburukan dan tidak mengendahkan syariat.\n<br><br>\n3.         Manusia dimuliakan dengan akal yang membezakannya daripada makhluk lain. Sebab itu akal dapat membezakan antara kebaikan dan keburukan.\n<br><br>\n4.         Seorang yang telah mengucapkan dua kalimah syahadah dan bertekad untuk komited terhadap syariat Allah SWT, maka dia telah beriman.\n<br><br>\n5.         Untuk meningkatkan iman ke tahap kesempurnaan, seseorang itu perlu mencintai apa yang dicintai Allah SAW dan juga membenci apa yang dibenci Allah SWT. Ia juga akan berkorban apa sahaja untuk kepentingan Allah dan Rasul-Nya.\n<br><br>\n6.         Kita hendaklah berhukum dengan hukum Allah SWT.\n<br><br>\n7.         Reda sepenuhnya dengan ketentuan Allah dalam segala hal sama ada hukum itu sesuai dengan hawa nafsu ataupun tidak.\n<br><br>\n8.         Mencintai apa yang dibenci Allah dan membenci apa yang dicintai Allah adalah tanda-tanda kekufuran.\n<br><br>\n9.         Para sahabat Rasulullah SAW adalah contoh yang ideal dalam mencintai Allah SWT dan Rasul-Nya.\n<br><br>\n10.       Setiap Muslim harus menyesuaikan setiap perbuatannya dengan al-Quran dan al-Sunnah.\n<br><br>\n11.       Sesiapa yang mengakui kebenaran syariat Allah dengan hatinya, mengucapkan pengakuan tersebut dengan lisan, namun perbuatannya tidak sesuai dengan syariat yang diyakininya itu, maka ia adalah orang fasiq.\n<br><br>\n12.       Sesiapa yang perbuatannya sesuai dengan syariat, namun dalam keyakinan dna fikirannya ia mengingkari kebenaran syariat Allah, maka ia termasuk di kalangan orang-orang munafik.\n<br><br>\n13.       Sesiapa memperlakukan hukum Allah sewenang-wenangnya, maka ia adalah orang zindiq.\n<br><br>\n14.       Keimanan juga termasuk membela dan mempertahankan syariat Allah SWT."
    },
    {
      "number": 42,
      "title": "Mencari Keampunan Allah",
      "arabicTitle": "",
      "imagePath": "assets/images/h42.jpg",
      "audioPath": "assets/audio/hadith42.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith42.png"
      ],
      "htmlDescription": "Daripada Anas bin Malik r.a berkata, bahawa dia mendengar Rasulullah SAW bersabda, bahawa Allah SWT berfirman:\n<br><br>\nMaksudnya: ”Wahai anak Adam, selagi engkau meminta dan berharap kepada-Ku maka Aku mengampuni segala dosamu yang telah lalu, dan Aku tidak akan mempedulikannya. <br> Wahai anak Adam, jika dosamu sampai setinggi langit lalu engkau minta ampun kepada-Ku nescaya Kuampuni.<br> Wahai anak Adam, jika engkau datang kepada-Ku dengan kesalahan seluas permukaan bumi lalu engkau menemui-Ku tanpa menyekutukan sesuatu pun dengan-Ku, nescaya Aku datang padamu dengan ampunan seluas bumi pula.”\n<br><br>\n(Riwayat al-Tirmizi no: 3534 dan al-Baghawi dalam Syarhus Sunnah)\n<br><br>\nPengajaran hadis:\n<br><br>\n1. Daripada Abu Ayyub ketika hendak wafat dia berkata: “Saya telah merahsiakan daripada kamu sesuatu yang pernah aku dengan daripada Rasulullah SAW, iaitu saya mendengar Baginda bersabda:\n<br><br>\n“Sekiranya kamu sekalian tidak berbuat dosa, nescaya Allah akan menggantikannya dengan makhluk lain yang berbuat dosa, lalu Allah memberi keampunan kepada mereka.”\n<br><br>\nDalam kenyataan Nabi yang berasingan, Baginda bersabda maksudnya: “Allah lebih bergembira atas taubat seorang hamba-Nya daripada (kegembiraan) seorang antara kamu yang menemui kembali haiwannya yang hilang.”\n<br><br>\n2. Berdoalah dengan penuh harapan, fokus, penuh penumpuan, taat, penuh keyakinan dan tidak terburu-buru disamping menjaga menjaga sumber rezeki yang kita dapat daripada sumber yang halal.\n<br><br>\n3. Allah Maha Berkuasa memberikan yang lebih baik daripada apa yang kita pinta.\n<br><br>\n4. Berdoalah dengan mematuhi adab-adab doa.\n<br><br>\n5. Memohon keampunan  walau sekecil mana dosa yang dilakukan.\n<br><br>\n\n6. Istighfar hendaklah diikuti dengan taubat.\n<br><br>\n7. Hendaklah sentiasa berbaik sangka dengan Allah SWT.\n<br><br>\n\n8. Sentiasa bertauhid kepada Allah dan tidak menyekutukan Allah."
    }
  ]
}